var APP_DATA = {
  "scenes": [
    {
      "id": "0--",
      "name": "Территория Сингапура",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 2.473484407300158,
        "pitch": -0.03704394237833952,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": 0.2561032006373942,
          "pitch": 0.21733806908529552,
          "rotation": 1.5707963267948966,
          "target": "3---"
        },
        {
          "yaw": 0.8516582673996034,
          "pitch": 0.14798927101046822,
          "rotation": 4.71238898038469,
          "target": "2---"
        },
        {
          "yaw": 0.6171509967225912,
          "pitch": 0.010896796683145027,
          "rotation": 3.141592653589793,
          "target": "1---"
        },
        {
          "yaw": 2.713171178976639,
          "pitch": 0.11694609819477364,
          "rotation": 4.71238898038469,
          "target": "6--"
        },
        {
          "yaw": -2.746460412308167,
          "pitch": 0.14808837608203262,
          "rotation": 4.71238898038469,
          "target": "4--"
        },
        {
          "yaw": 2.5026305425602082,
          "pitch": 0.10591447976775648,
          "rotation": 12.566370614359176,
          "target": "5---"
        },
        {
          "yaw": 1.85940491583447,
          "pitch": 0.1138087722898824,
          "rotation": 10.995574287564278,
          "target": "7-"
        },
        {
          "yaw": 1.3026246950282605,
          "pitch": -0.6231887944727603,
          "rotation": 0,
          "target": "39--10"
        },
        {
          "yaw": 1.6610510340306437,
          "pitch": -0.5701828220641456,
          "rotation": 0,
          "target": "38--9--"
        },
        {
          "yaw": 1.436838774554758,
          "pitch": -0.330940886041283,
          "rotation": 0,
          "target": "29--3"
        },
        {
          "yaw": 1.8391287654262758,
          "pitch": -0.27023884625149464,
          "rotation": 0,
          "target": "18--3-2-"
        },
        {
          "yaw": 2.0156790191141702,
          "pitch": -0.2297267199824411,
          "rotation": 0,
          "target": "35--7"
        },
        {
          "yaw": 2.144225458673227,
          "pitch": -0.14626555196558222,
          "rotation": 0,
          "target": "36--8"
        },
        {
          "yaw": 1.4477307762446996,
          "pitch": -0.0190125916073125,
          "rotation": 0,
          "target": "16-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "1---",
      "name": "Вид с улицы",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 2.5377596540720457,
        "pitch": 0,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": 2.1910643714477622,
          "pitch": -0.06937983314536211,
          "rotation": 4.71238898038469,
          "target": "3---"
        },
        {
          "yaw": 1.6008425093772782,
          "pitch": -0.0575092831817372,
          "rotation": 1.5707963267948966,
          "target": "2---"
        },
        {
          "yaw": 1.9257307379114428,
          "pitch": -0.27200343380676983,
          "rotation": 3.141592653589793,
          "target": "0--"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 2.9747654964931787,
          "pitch": -0.23264464756952563,
          "title": "Коттедж Ливерпуль",
          "text": "Тоже можно арендовать"
        }
      ]
    },
    {
      "id": "2---",
      "name": "Парковка. У Сингапура",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 2.9074197508175317,
        "pitch": -0.37358933971524344,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": -1.0885513336524255,
          "pitch": -0.0008372574856387871,
          "rotation": 4.71238898038469,
          "target": "1---"
        },
        {
          "yaw": -2.6919776880693576,
          "pitch": -0.030418027051275942,
          "rotation": 4.71238898038469,
          "target": "0--"
        },
        {
          "yaw": -2.2433211959667254,
          "pitch": 0.025617662001192087,
          "rotation": 4.71238898038469,
          "target": "3---"
        },
        {
          "yaw": 3.0514418947621884,
          "pitch": -0.12825600580546492,
          "rotation": 0,
          "target": "14----"
        },
        {
          "yaw": 3.0597015451619853,
          "pitch": -0.7040125327820679,
          "rotation": 0,
          "target": "26--1"
        },
        {
          "yaw": 2.465336588348862,
          "pitch": -0.4680577275455633,
          "rotation": 0,
          "target": "28--2--"
        },
        {
          "yaw": 1.8258995951386954,
          "pitch": -0.10738992317036278,
          "rotation": 1.5707963267948966,
          "target": "42-----"
        },
        {
          "yaw": 2.5933859759085394,
          "pitch": -0.7817427039075824,
          "rotation": 0,
          "target": "24----3-"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -2.239642291374393,
          "pitch": -0.14240701960181923,
          "title": "Коттедж Ливерпуль",
          "text": "Тоже очень хороший коттедж)"
        },
        {
          "yaw": -2.5328670217280234,
          "pitch": -0.045286824335050824,
          "title": "Коттедж Валенсия",
          "text": "Коттедж Мальта<br>Коттедж Кипр"
        },
        {
          "yaw": -1.979020246938756,
          "pitch": 0.002420044705557345,
          "title": "Техническое помещение",
          "text": "Гараж с инструментами"
        }
      ]
    },
    {
      "id": "3---",
      "name": "Парковка. У Ливерпуля",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -2.993215581468066,
        "pitch": 0.27725383581191565,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": -2.4159301185085695,
          "pitch": -0.03841375147959525,
          "rotation": 3.141592653589793,
          "target": "0--"
        },
        {
          "yaw": 2.618066923730199,
          "pitch": 0.06605343145972853,
          "rotation": 3.141592653589793,
          "target": "2---"
        },
        {
          "yaw": 1.671099518939501,
          "pitch": 0.010924353937113551,
          "rotation": 3.141592653589793,
          "target": "1---"
        },
        {
          "yaw": 3.1235022050502694,
          "pitch": -0.04235829851920769,
          "rotation": 3.141592653589793,
          "target": "15---"
        },
        {
          "yaw": -2.9408842655281546,
          "pitch": -0.07222845421733481,
          "rotation": 3.141592653589793,
          "target": "17--"
        },
        {
          "yaw": 2.7360786620163102,
          "pitch": -0.010998401593010243,
          "rotation": 1.5707963267948966,
          "target": "14----"
        },
        {
          "yaw": -2.6215724899791226,
          "pitch": -0.004987600107519086,
          "rotation": 4.71238898038469,
          "target": "7-"
        },
        {
          "yaw": 3.119056973905087,
          "pitch": -0.2417437881645892,
          "rotation": 0,
          "target": "19--4-2-"
        },
        {
          "yaw": -2.9429254737587005,
          "pitch": -0.24233500795141438,
          "rotation": 0,
          "target": "31--4-"
        },
        {
          "yaw": -2.7238972290978225,
          "pitch": -0.23186684499096444,
          "rotation": 0,
          "target": "29--3"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.0134439943091742,
          "pitch": -0.9168211829121518,
          "title": "Коттедж Ливерпуль",
          "text": "Тоже очень хороший коттедж)"
        },
        {
          "yaw": -1.5086157807550293,
          "pitch": -0.1520997277505991,
          "title": "Коттедж Валенсия",
          "text": "Коттедж Мальта<br>Коттедж Кипр"
        }
      ]
    },
    {
      "id": "4--",
      "name": "Мангальная площадка",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -3.0136268366705714,
        "pitch": 0.03297081526176271,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": 2.0692536599676563,
          "pitch": -0.021197773049989266,
          "rotation": 3.141592653589793,
          "target": "0--"
        },
        {
          "yaw": 2.2993238230599005,
          "pitch": -0.018702643541022468,
          "rotation": 3.9269908169872414,
          "target": "2---"
        },
        {
          "yaw": 2.8350491505956548,
          "pitch": 0.04102965885055454,
          "rotation": 0,
          "target": "7-"
        },
        {
          "yaw": -2.726975555620747,
          "pitch": 0.058029690555827074,
          "rotation": 0,
          "target": "5---"
        },
        {
          "yaw": -2.617109774664634,
          "pitch": 0.06643067803097935,
          "rotation": 4.71238898038469,
          "target": "6--"
        },
        {
          "yaw": 2.644427858182013,
          "pitch": -0.06113232225215981,
          "rotation": 0,
          "target": "17--"
        },
        {
          "yaw": 2.6431792146022923,
          "pitch": -0.26245996683263684,
          "rotation": 0,
          "target": "29--3"
        },
        {
          "yaw": 2.97042639771694,
          "pitch": -0.25718975986799464,
          "rotation": 0,
          "target": "18--3-2-"
        },
        {
          "yaw": -3.106717094225779,
          "pitch": -0.23532873938146537,
          "rotation": 0,
          "target": "35--7"
        },
        {
          "yaw": 2.564907340247612,
          "pitch": -0.45595614971874454,
          "rotation": 0,
          "target": "39--10"
        },
        {
          "yaw": 2.824208886825229,
          "pitch": -0.4639106652376732,
          "rotation": 0,
          "target": "38--9--"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 2.619961902180081,
          "pitch": 0.33633669007821254,
          "title": "Уголь, розжиг и мясо",
          "text": "Приобретаются самостоятельно"
        }
      ]
    },
    {
      "id": "5---",
      "name": "В беседке. Центр",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -2.9904554272528223,
        "pitch": 0.017689623943240917,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": -1.5405131812761432,
          "pitch": 0.5719233923438178,
          "rotation": 3.141592653589793,
          "target": "6--"
        },
        {
          "yaw": -0.5190245953082844,
          "pitch": 0.010146149307868058,
          "rotation": 2.356194490192345,
          "target": "4--"
        },
        {
          "yaw": 0.009034869331674855,
          "pitch": -0.02015146829722525,
          "rotation": 3.141592653589793,
          "target": "0--"
        },
        {
          "yaw": 0.6780710158269283,
          "pitch": 0.0009630829649651673,
          "rotation": 1.5707963267948966,
          "target": "7-"
        },
        {
          "yaw": 0.5539444091073076,
          "pitch": -0.04474805907303825,
          "rotation": 3.141592653589793,
          "target": "2---"
        },
        {
          "yaw": 0.7467435072885635,
          "pitch": -0.5304335158613682,
          "rotation": 1.5707963267948966,
          "target": "39--10"
        },
        {
          "yaw": 0.7949955206800396,
          "pitch": -0.3435228497565781,
          "rotation": 1.5707963267948966,
          "target": "29--3"
        },
        {
          "yaw": 1.1382436194103818,
          "pitch": -0.4471014412559846,
          "rotation": 0.7853981633974483,
          "target": "18--3-2-"
        },
        {
          "yaw": 0.9755803920365409,
          "pitch": -0.6408792090194364,
          "rotation": 0,
          "target": "39--10"
        },
        {
          "yaw": 1.1442645576340826,
          "pitch": -0.04291583925554043,
          "rotation": 0.7853981633974483,
          "target": "9----1-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "6--",
      "name": "В беседке",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -2.8893081478277214,
        "pitch": 0.003823439507572246,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": 0.7486214627374395,
          "pitch": 0.018752717163401655,
          "rotation": 1.5707963267948966,
          "target": "4--"
        },
        {
          "yaw": 1.2226601461895026,
          "pitch": -0.01603313404318385,
          "rotation": 3.141592653589793,
          "target": "0--"
        },
        {
          "yaw": 1.682916031902308,
          "pitch": 0.03585360680319738,
          "rotation": 9.42477796076938,
          "target": "3---"
        },
        {
          "yaw": 1.8308415927714456,
          "pitch": 0.03906937221599094,
          "rotation": 1.5707963267948966,
          "target": "7-"
        },
        {
          "yaw": 2.852815549143668,
          "pitch": 0.5438355818327043,
          "rotation": 1.5707963267948966,
          "target": "5---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "7-",
      "name": "Тамбур",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 3.0403491181607425,
        "pitch": 0.08685499794533591,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": 0.003906219121091681,
          "pitch": -0.019993365621857606,
          "rotation": 3.141592653589793,
          "target": "4--"
        },
        {
          "yaw": -3.0926644230849387,
          "pitch": 0.6499264199299972,
          "rotation": 0,
          "target": "8----1-"
        },
        {
          "yaw": 3.0793303057257164,
          "pitch": 0.16085866103301427,
          "rotation": 0,
          "target": "11----1-"
        },
        {
          "yaw": -2.7258268083329256,
          "pitch": 0.09206796146767537,
          "rotation": 5.497787143782138,
          "target": "9----1-"
        },
        {
          "yaw": 2.829321593740982,
          "pitch": -0.05436337233448896,
          "rotation": 4.71238898038469,
          "target": "12--1-"
        },
        {
          "yaw": 3.1299268738839707,
          "pitch": 0.39697999607246004,
          "rotation": 0,
          "target": "10--1-"
        },
        {
          "yaw": -2.974979991825345,
          "pitch": 0.054105002450665296,
          "rotation": 1.5707963267948966,
          "target": "41---"
        },
        {
          "yaw": 0.19075031250919672,
          "pitch": 0.12463478410717244,
          "rotation": 10.210176124166829,
          "target": "0--"
        },
        {
          "yaw": 1.5282830333618875,
          "pitch": 0.06435752157747743,
          "rotation": 3.141592653589793,
          "target": "3---"
        },
        {
          "yaw": -2.8204705060097606,
          "pitch": -0.2774689167507667,
          "rotation": 5.497787143782138,
          "target": "20----2-"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -2.9743983775921645,
          "pitch": -0.03018826940133934,
          "title": "<span style=\"font-size: 13px; background-color: rgba(58, 68, 84, 0.8);\">Банкетный зал</span>",
          "text": "Банкетный зал арендуется отдельно от коттеджа Сингапур"
        }
      ]
    },
    {
      "id": "8----1-",
      "name": "Вестибюль. У входа. 1 этаж",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -2.5745372564185285,
        "pitch": 0.012317405598116338,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": -2.6226996799946356,
          "pitch": 0.9379315777746235,
          "rotation": 0,
          "target": "10--1-"
        },
        {
          "yaw": -1.9625280180850524,
          "pitch": 0.37725886398950337,
          "rotation": 5.497787143782138,
          "target": "9----1-"
        },
        {
          "yaw": 2.7304410696257086,
          "pitch": -0.10537336658066998,
          "rotation": 4.71238898038469,
          "target": "12--1-"
        },
        {
          "yaw": -3.014105914140174,
          "pitch": 0.19134688024466762,
          "rotation": 0,
          "target": "11----1-"
        },
        {
          "yaw": -2.5507889594011885,
          "pitch": -0.30149713687989177,
          "rotation": 5.497787143782138,
          "target": "20----2-"
        },
        {
          "yaw": 0.19975625676057973,
          "pitch": 0.7184802576520148,
          "rotation": 0,
          "target": "7-"
        },
        {
          "yaw": 0.23441077732212534,
          "pitch": 0.01372008702334604,
          "rotation": 3.141592653589793,
          "target": "4--"
        },
        {
          "yaw": -2.7265316795903125,
          "pitch": 0.08628592369445087,
          "rotation": 1.5707963267948966,
          "target": "41---"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -2.7267388386148994,
          "pitch": -0.026616900087162776,
          "title": "<span style=\"font-size: 13px; background-color: rgba(58, 68, 84, 0.8);\">Банкетный зал</span>",
          "text": "Банкетный зал арендуется отдельно от коттеджа Сингапур"
        }
      ]
    },
    {
      "id": "9----1-",
      "name": "Вестибюль. На лестнице. 1 этаж",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -0.8694712663998292,
        "pitch": 0.10311985907825516,
        "fov": 1.4977453684186188
      },
      "linkHotspots": [
        {
          "yaw": -2.3577136362966193,
          "pitch": 0.1669872949368223,
          "rotation": 4.71238898038469,
          "target": "7-"
        },
        {
          "yaw": 3.0546305012101715,
          "pitch": 0.006792983990798973,
          "rotation": 3.141592653589793,
          "target": "4--"
        },
        {
          "yaw": -1.5235038767304339,
          "pitch": 0.015142137730352445,
          "rotation": 0,
          "target": "12--1-"
        },
        {
          "yaw": -0.5643035613988197,
          "pitch": 0.060304167328384395,
          "rotation": 3.9269908169872414,
          "target": "11----1-"
        },
        {
          "yaw": -1.2017432845887903,
          "pitch": 0.7222539183112193,
          "rotation": 0.7853981633974483,
          "target": "10--1-"
        },
        {
          "yaw": -2.118895818479576,
          "pitch": 0.6909877017036763,
          "rotation": 1.5707963267948966,
          "target": "8----1-"
        },
        {
          "yaw": -0.18120368548931864,
          "pitch": -0.33068911079138275,
          "rotation": 0,
          "target": "20----2-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "10--1-",
      "name": "Вестибюль. 1 этаж",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 3.083261023713673,
        "pitch": 0.007319486442241896,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": -0.109726355389002,
          "pitch": 0.716365212046874,
          "rotation": 0,
          "target": "8----1-"
        },
        {
          "yaw": -0.10097401367065828,
          "pitch": 0.27780212292367423,
          "rotation": 0,
          "target": "7-"
        },
        {
          "yaw": -0.7922784375799559,
          "pitch": -0.06821231597085031,
          "rotation": 0,
          "target": "6--"
        },
        {
          "yaw": 1.236268471023406,
          "pitch": -0.08092790168069186,
          "rotation": 0,
          "target": "12--1-"
        },
        {
          "yaw": 2.8543403564367553,
          "pitch": 0.19945500549959405,
          "rotation": 0,
          "target": "11----1-"
        },
        {
          "yaw": -1.5314955633920668,
          "pitch": 0.4619789515199777,
          "rotation": 5.497787143782138,
          "target": "9----1-"
        },
        {
          "yaw": -2.736712030647162,
          "pitch": -0.4399837597355223,
          "rotation": 5.497787143782138,
          "target": "20----2-"
        },
        {
          "yaw": -3.052692497519711,
          "pitch": 0.08843547667087392,
          "rotation": 1.5707963267948966,
          "target": "41---"
        },
        {
          "yaw": 2.8931176067706827,
          "pitch": -1.5707963267948966,
          "rotation": 0,
          "target": "21--2-"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -3.0498585654777113,
          "pitch": 0.005664393396701328,
          "title": "Банкетный зал",
          "text": "Арендуется отдельно от коттеджа Сингапур"
        }
      ]
    },
    {
      "id": "11----1-",
      "name": "Вестибюль. У пианино. 1 этаж",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -3.1222813766139765,
        "pitch": 0.017334854844598624,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": -3.0879864166702795,
          "pitch": 0.18618873477792341,
          "rotation": 0,
          "target": "8----1-"
        },
        {
          "yaw": -3.106003356587726,
          "pitch": 0.3080629754023967,
          "rotation": 0,
          "target": "10--1-"
        },
        {
          "yaw": -2.9728141932096896,
          "pitch": 0.0034350425093592207,
          "rotation": 1.5707963267948966,
          "target": "12--1-"
        },
        {
          "yaw": -3.07807470926641,
          "pitch": 0.02179205887346569,
          "rotation": 0,
          "target": "7-"
        },
        {
          "yaw": -0.32032466412155536,
          "pitch": 0.0823393416997078,
          "rotation": 3.9269908169872414,
          "target": "14----"
        },
        {
          "yaw": -1.3652745840982057,
          "pitch": 0.8862505136960639,
          "rotation": 1.5707963267948966,
          "target": "15---"
        },
        {
          "yaw": -1.7810460040037093,
          "pitch": 0.27413875586508496,
          "rotation": 4.71238898038469,
          "target": "17--"
        },
        {
          "yaw": -2.1280105311114283,
          "pitch": 0.05544784205104136,
          "rotation": 4.71238898038469,
          "target": "16-"
        },
        {
          "yaw": 2.6740475715590124,
          "pitch": -0.29053335798672464,
          "rotation": 0,
          "target": "20----2-"
        },
        {
          "yaw": 2.8898788400525515,
          "pitch": 0.14264428285579456,
          "rotation": 5.497787143782138,
          "target": "9----1-"
        },
        {
          "yaw": 1.5121358198173134,
          "pitch": 0.25473018147773097,
          "rotation": 0,
          "target": "41---"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.5165161000210956,
          "pitch": 0.0338648162641455,
          "title": "Банкетный зал",
          "text": "Снимается отдельно"
        }
      ]
    },
    {
      "id": "12--1-",
      "name": "Санузел. 1 этаж",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -2.6155209287016667,
        "pitch": 0.03074870462103263,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": -2.8890681277459827,
          "pitch": 0.42679553169421247,
          "rotation": 0,
          "target": "13--2--1-"
        },
        {
          "yaw": 2.631755698377855,
          "pitch": 0.4270639043778335,
          "rotation": 0,
          "target": "13--2--1-"
        },
        {
          "yaw": -0.22210173514685572,
          "pitch": 0.06865619671299683,
          "rotation": 0,
          "target": "10--1-"
        },
        {
          "yaw": 1.452020663048252,
          "pitch": -0.1953761938909082,
          "rotation": 0,
          "target": "4--"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "13--2--1-",
      "name": "Санузел 2. Внутри 1 этаж",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -2.6332224007097125,
        "pitch": 0.6913058474864275,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": 1.0526964757582036,
          "pitch": 0.5107324059095504,
          "rotation": 0,
          "target": "12--1-"
        },
        {
          "yaw": 0.8393570976855358,
          "pitch": 0.05346293353855458,
          "rotation": 0,
          "target": "10--1-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "14----",
      "name": "Банкетная зона. У эркера",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 2.8038271965055124,
        "pitch": 0.023218807595954516,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": 2.159684827767223,
          "pitch": 0.25715994679753074,
          "rotation": 3.141592653589793,
          "target": "15---"
        },
        {
          "yaw": 2.039796738210936,
          "pitch": 0.1760561204457396,
          "rotation": 0,
          "target": "11----1-"
        },
        {
          "yaw": 2.568521096909347,
          "pitch": 0.05919326510552736,
          "rotation": 0,
          "target": "16-"
        },
        {
          "yaw": 2.509009825380053,
          "pitch": 0.13154467922545265,
          "rotation": 0,
          "target": "17--"
        },
        {
          "yaw": -1.475696683379768,
          "pitch": 0.041602737176202,
          "rotation": 0,
          "target": "2---"
        },
        {
          "yaw": 2.086796727636168,
          "pitch": 0.07354302144180203,
          "rotation": 5.497787143782138,
          "target": "9----1-"
        },
        {
          "yaw": 1.963197548301209,
          "pitch": -0.10183892592520039,
          "rotation": 0,
          "target": "20----2-"
        },
        {
          "yaw": 0.22655066644841781,
          "pitch": -0.09368327110878027,
          "rotation": 1.5707963267948966,
          "target": "42-----"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "15---",
      "name": "Банкетная зона. Центр",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -1.801780001237553,
        "pitch": -0.009710616484209567,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": -2.9297835737034212,
          "pitch": 0.414787606647419,
          "rotation": 5.497787143782138,
          "target": "17--"
        },
        {
          "yaw": 2.9590036832071087,
          "pitch": 0.24691571190587958,
          "rotation": 5.497787143782138,
          "target": "16-"
        },
        {
          "yaw": 1.320455739857005,
          "pitch": 0.5435449461937623,
          "rotation": 0.7853981633974483,
          "target": "11----1-"
        },
        {
          "yaw": -1.1438744804423902,
          "pitch": 0.26749452734595636,
          "rotation": 3.141592653589793,
          "target": "14----"
        },
        {
          "yaw": 1.4532339098676914,
          "pitch": -0.21863910205293635,
          "rotation": 5.497787143782138,
          "target": "20----2-"
        },
        {
          "yaw": 1.6673278901771331,
          "pitch": 0.09539340485220293,
          "rotation": 5.497787143782138,
          "target": "9----1-"
        },
        {
          "yaw": 0.48646121735226444,
          "pitch": 0.15226020717306454,
          "rotation": 0,
          "target": "41---"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.4896673429879197,
          "pitch": 0.05752668860872845,
          "title": "Банкетный зал",
          "text": "Снимается отдельно"
        }
      ]
    },
    {
      "id": "16-",
      "name": "Кухня",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -1.8957810659062133,
        "pitch": -0.013751860242631864,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": 2.2188443477054323,
          "pitch": 0.11903825727245554,
          "rotation": 2.356194490192345,
          "target": "14----"
        },
        {
          "yaw": 2.8797714671216887,
          "pitch": 0.38339443667749684,
          "rotation": 4.71238898038469,
          "target": "15---"
        },
        {
          "yaw": 2.1871288338876633,
          "pitch": 0.7349835082635909,
          "rotation": 0,
          "target": "17--"
        },
        {
          "yaw": 3.0394060190685863,
          "pitch": -0.006176871603019052,
          "rotation": 0,
          "target": "41---"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 3.0409469303295076,
          "pitch": 0.06815195119718176,
          "title": "Банкетный зал",
          "text": "Снимается отдельно от коттеджа Сингапур"
        }
      ]
    },
    {
      "id": "17--",
      "name": "Кухня. Центр",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -0.3553448860292683,
        "pitch": 0.0010313764055425167,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": -0.289004615617781,
          "pitch": 0.5397429615535874,
          "rotation": 0,
          "target": "16-"
        },
        {
          "yaw": 3.06556418940073,
          "pitch": 0.30218345623616294,
          "rotation": 2.356194490192345,
          "target": "14----"
        },
        {
          "yaw": -2.348593712185874,
          "pitch": 0.6148311569814453,
          "rotation": 5.497787143782138,
          "target": "15---"
        },
        {
          "yaw": -2.2081227811305766,
          "pitch": 0.18782008009879192,
          "rotation": 0,
          "target": "41---"
        },
        {
          "yaw": 2.753183702966675,
          "pitch": 0.027470492049145534,
          "rotation": 0,
          "target": "2---"
        },
        {
          "yaw": 1.5267038282030798,
          "pitch": -0.014961196391066522,
          "rotation": 3.141592653589793,
          "target": "3---"
        },
        {
          "yaw": 0.5321955016663331,
          "pitch": -0.08593375789413393,
          "rotation": 0,
          "target": "0--"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -2.207634563387259,
          "pitch": 0.08781079431969907,
          "title": "Банкетный зал",
          "text": "Банкетный зал арендуется отдельно от коттеджа Сингапур"
        }
      ]
    },
    {
      "id": "18--3-2-",
      "name": "Санузел 3. 2 этаж",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 0.42065321625918095,
        "pitch": 0.22351838829468385,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": -1.913281060802145,
          "pitch": 0.8096887876332506,
          "rotation": 0,
          "target": "21--2-"
        },
        {
          "yaw": -1.7103800760861532,
          "pitch": 0.3242611567767586,
          "rotation": 0,
          "target": "20----2-"
        },
        {
          "yaw": -2.089124830070965,
          "pitch": -0.03298740953102097,
          "rotation": 0,
          "target": "26--1"
        },
        {
          "yaw": -2.199495724801377,
          "pitch": 0.0038093703964072745,
          "rotation": 4.71238898038469,
          "target": "30--4--"
        },
        {
          "yaw": -1.7595515594248,
          "pitch": 0.013877248563833433,
          "rotation": 0,
          "target": "28--2--"
        },
        {
          "yaw": -1.7569380074744654,
          "pitch": 0.1257975044090358,
          "rotation": 0,
          "target": "27---2-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "19--4-2-",
      "name": "Санузел 4. 2 этаж",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 2.8862950374928227,
        "pitch": 0.4226840222812527,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": 1.2078365535435829,
          "pitch": 0.2372109555114399,
          "rotation": 0.7853981633974483,
          "target": "20----2-"
        },
        {
          "yaw": 0.6009192914015138,
          "pitch": 0.040784003269450864,
          "rotation": 4.71238898038469,
          "target": "26--1"
        },
        {
          "yaw": 1.1320335179343353,
          "pitch": -0.0013622813279106083,
          "rotation": 1.5707963267948966,
          "target": "35--7"
        },
        {
          "yaw": 0.9224551311289115,
          "pitch": 0.12158119545977542,
          "rotation": 0,
          "target": "33--6--"
        },
        {
          "yaw": 1.1343005615585238,
          "pitch": 0.11199150452883444,
          "rotation": 10.995574287564278,
          "target": "36--8"
        },
        {
          "yaw": 0.9255598210599754,
          "pitch": -0.012257137384020567,
          "rotation": 4.71238898038469,
          "target": "32--5"
        },
        {
          "yaw": 1.305738552225474,
          "pitch": -0.05494214996599567,
          "rotation": 5.497787143782138,
          "target": "22---2--3-"
        },
        {
          "yaw": 1.27585109583136,
          "pitch": -0.41195203058514807,
          "rotation": 5.497787143782138,
          "target": "23----3-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "20----2-",
      "name": "Холл. У лестницы. 2 этаж",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 2.716996512743263,
        "pitch": 0.01049979841980253,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": 0.027259511376716006,
          "pitch": 0.7130809483965805,
          "rotation": 0,
          "target": "9----1-"
        },
        {
          "yaw": 0.346232213777828,
          "pitch": -0.018850855459302096,
          "rotation": 0,
          "target": "18--3-2-"
        },
        {
          "yaw": 0.8105414523871879,
          "pitch": -0.028910675995286184,
          "rotation": 1.5707963267948966,
          "target": "29--3"
        },
        {
          "yaw": 1.6859412674185386,
          "pitch": 0.27079826432623477,
          "rotation": 0,
          "target": "30--4--"
        },
        {
          "yaw": 1.7023136657499336,
          "pitch": 0.15017019474258753,
          "rotation": 0,
          "target": "31--4-"
        },
        {
          "yaw": 2.1944903094153103,
          "pitch": 0.03588579929855307,
          "rotation": 0,
          "target": "19--4-2-"
        },
        {
          "yaw": 2.4167703189436995,
          "pitch": -0.00915505645349235,
          "rotation": 1.5707963267948966,
          "target": "26--1"
        },
        {
          "yaw": 3.034556896962176,
          "pitch": 0.3310701318017095,
          "rotation": 0,
          "target": "27---2-"
        },
        {
          "yaw": 3.0808782654594626,
          "pitch": 0.14155350763552121,
          "rotation": 0,
          "target": "28--2--"
        },
        {
          "yaw": -1.4736276917102593,
          "pitch": 0.3157693262806056,
          "rotation": 0,
          "target": "36--8"
        },
        {
          "yaw": -1.1679081525938972,
          "pitch": 0.07154004894273669,
          "rotation": 1.5707963267948966,
          "target": "35--7"
        },
        {
          "yaw": -2.714589620183949,
          "pitch": 0.11162566449581846,
          "rotation": 6.283185307179586,
          "target": "32--5"
        },
        {
          "yaw": -2.610255927795194,
          "pitch": 0.1642196085554577,
          "rotation": 0.7853981633974483,
          "target": "33--6--"
        },
        {
          "yaw": 2.0767703394269432,
          "pitch": 0.04003937118302048,
          "rotation": 0,
          "target": "22---2--3-"
        },
        {
          "yaw": 2.138131407581663,
          "pitch": -0.39515405504792867,
          "rotation": 0,
          "target": "23----3-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "21--2-",
      "name": "Холл. 2 этаж",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -2.8474926539565324,
        "pitch": -0.01009099780715772,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": -2.4091398640633486,
          "pitch": 0.4143677552059408,
          "rotation": 0,
          "target": "20----2-"
        },
        {
          "yaw": -1.8726352333302287,
          "pitch": 0.6417216255883371,
          "rotation": 8.63937979737193,
          "target": "9----1-"
        },
        {
          "yaw": -0.719314095712976,
          "pitch": 0.47834025107549216,
          "rotation": 0,
          "target": "18--3-2-"
        },
        {
          "yaw": 1.6413388079198281,
          "pitch": 0.16211470494336844,
          "rotation": 0,
          "target": "29--3"
        },
        {
          "yaw": 3.0287548964324085,
          "pitch": -0.0179574663114348,
          "rotation": 4.71238898038469,
          "target": "30--4--"
        },
        {
          "yaw": -2.787578597309155,
          "pitch": 0.02817447002977147,
          "rotation": 0,
          "target": "27---2-"
        },
        {
          "yaw": 3.1134798192034845,
          "pitch": 0.06952512706665281,
          "rotation": 0,
          "target": "26--1"
        },
        {
          "yaw": -2.4984982952212853,
          "pitch": -0.056215179838858376,
          "rotation": 1.5707963267948966,
          "target": "33--6--"
        },
        {
          "yaw": -2.5017860872506184,
          "pitch": 0.11378431328469496,
          "rotation": 10.995574287564278,
          "target": "32--5"
        },
        {
          "yaw": -2.228539974543903,
          "pitch": -0.07939165933138881,
          "rotation": 1.5707963267948966,
          "target": "35--7"
        },
        {
          "yaw": -2.2261873128805565,
          "pitch": 0.07147035465765939,
          "rotation": 17.27875959474387,
          "target": "36--8"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "22---2--3-",
      "name": "Лестница со 2 на 3 этаж",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 2.932166416331434,
        "pitch": 0.006404413626004413,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": 1.9847107260686734,
          "pitch": 0.2564913088480534,
          "rotation": 4.71238898038469,
          "target": "19--4-2-"
        },
        {
          "yaw": -2.9765304940976822,
          "pitch": 0.0003545040274008926,
          "rotation": 4.71238898038469,
          "target": "26--1"
        },
        {
          "yaw": 2.87917315030046,
          "pitch": 0.7812160593002577,
          "rotation": 1.5707963267948966,
          "target": "21--2-"
        },
        {
          "yaw": 2.7323718695397847,
          "pitch": 0.11153953896604207,
          "rotation": 1.5707963267948966,
          "target": "20----2-"
        },
        {
          "yaw": -2.22892637542844,
          "pitch": -0.5885699590046958,
          "rotation": 0,
          "target": "23----3-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "23----3-",
      "name": "Холл. У лестницы. 3 этаж",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 1.4233083641239475,
        "pitch": -0.1201357639748224,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": -0.045046291215737,
          "pitch": 0.8679269084524677,
          "rotation": 3.141592653589793,
          "target": "22---2--3-"
        },
        {
          "yaw": 1.1536915153570693,
          "pitch": 0.4889215232971189,
          "rotation": 0,
          "target": "24----3-"
        },
        {
          "yaw": -0.7332852442541196,
          "pitch": 0.02082998072622999,
          "rotation": 0.7853981633974483,
          "target": "25--5-3-"
        },
        {
          "yaw": -1.5658438610046268,
          "pitch": 0.3722086460175511,
          "rotation": 0,
          "target": "37--9--"
        },
        {
          "yaw": -1.1423774481630158,
          "pitch": 0.09908796856096558,
          "rotation": 0,
          "target": "39--10"
        },
        {
          "yaw": -1.5698063575400454,
          "pitch": 0.14983495448623785,
          "rotation": 0,
          "target": "38--9--"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "24----3-",
      "name": "Холл. В центре. 3 этаж",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -1.4215959486155718,
        "pitch": 0.09266841569693973,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": -1.005814214573876,
          "pitch": 0.537804413733932,
          "rotation": 2.356194490192345,
          "target": "22---2--3-"
        },
        {
          "yaw": -1.2368985798898695,
          "pitch": -0.02308386935196083,
          "rotation": 1.5707963267948966,
          "target": "25--5-3-"
        },
        {
          "yaw": -1.4098390247514256,
          "pitch": -0.017982949182623997,
          "rotation": 0,
          "target": "39--10"
        },
        {
          "yaw": -1.6544568339321906,
          "pitch": 0.20793973309926628,
          "rotation": 0,
          "target": "37--9--"
        },
        {
          "yaw": -1.6637427482425675,
          "pitch": 0.07334175579451241,
          "rotation": 0,
          "target": "38--9--"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "25--5-3-",
      "name": "Санузел 5. 3 этаж",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 2.7702210256858937,
        "pitch": 0.23416574327321626,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": 1.301186593536336,
          "pitch": 0.1283052329941583,
          "rotation": 0,
          "target": "23----3-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "26--1",
      "name": "Спальня 1",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 2.099479671337619,
        "pitch": 0.02539338969620175,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": -1.4664073290352952,
          "pitch": 0.062392328335953096,
          "rotation": 0,
          "target": "20----2-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "27---2-",
      "name": "Спальня  2. Вход",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -2.863759632550222,
        "pitch": 0.010752563922917346,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": -2.1252001648305345,
          "pitch": 0.6394911733321766,
          "rotation": 4.71238898038469,
          "target": "28--2--"
        },
        {
          "yaw": 1.045758015724772,
          "pitch": 0.4325758792855474,
          "rotation": 0,
          "target": "20----2-"
        },
        {
          "yaw": 1.0707686226170807,
          "pitch": 0.2082735594419276,
          "rotation": 2.356194490192345,
          "target": "21--2-"
        },
        {
          "yaw": 1.4705894085907385,
          "pitch": 0.012760844585628206,
          "rotation": 1.5707963267948966,
          "target": "30--4--"
        },
        {
          "yaw": 1.1936941979372637,
          "pitch": -0.008253909213699728,
          "rotation": 20.420352248333668,
          "target": "29--3"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "28--2--",
      "name": "Спальня 2. В центре",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -3.0858906561857182,
        "pitch": 0.01966115831288029,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": 2.0459044108976574,
          "pitch": 0.08354545339684627,
          "rotation": 0,
          "target": "21--2-"
        },
        {
          "yaw": 2.1186672794104027,
          "pitch": 0.6349103969148437,
          "rotation": 1.5707963267948966,
          "target": "27---2-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "29--3",
      "name": "Спальня 3",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 2.8302725074519177,
        "pitch": 0.014835708712405804,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": 1.0026363683935386,
          "pitch": 0.1313709252412174,
          "rotation": 1.5707963267948966,
          "target": "18--3-2-"
        },
        {
          "yaw": 0.7991939692706644,
          "pitch": 0.6471770286691054,
          "rotation": 4.71238898038469,
          "target": "21--2-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "30--4--",
      "name": "Спальня 4. У входа",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 3.004216146259102,
        "pitch": -0.007506705751341158,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": 0.872029082259866,
          "pitch": 0.4297987388129414,
          "rotation": 0,
          "target": "20----2-"
        },
        {
          "yaw": 1.3543808251509333,
          "pitch": 0.5459908699746574,
          "rotation": 4.71238898038469,
          "target": "21--2-"
        },
        {
          "yaw": 0.6760792731490746,
          "pitch": 0.0825017800765302,
          "rotation": 0,
          "target": "36--8"
        },
        {
          "yaw": 0.799025732753794,
          "pitch": 0.08183037522245407,
          "rotation": 1.5707963267948966,
          "target": "35--7"
        },
        {
          "yaw": 0.18710302063258943,
          "pitch": 0.07505018700206278,
          "rotation": 4.71238898038469,
          "target": "32--5"
        },
        {
          "yaw": 0.27534213749581404,
          "pitch": 0.0766638738676555,
          "rotation": 12.566370614359176,
          "target": "33--6--"
        },
        {
          "yaw": -2.5800640031649955,
          "pitch": 0.6528663959452778,
          "rotation": 0,
          "target": "31--4-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "31--4-",
      "name": "Спальня 4. Центр",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -3.1272745492863088,
        "pitch": 0.0154092169824942,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": 0.7338794862211007,
          "pitch": 0.8369590199008101,
          "rotation": 0,
          "target": "30--4--"
        },
        {
          "yaw": 0.7262824414535825,
          "pitch": 0.1466165926206564,
          "rotation": 0,
          "target": "20----2-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "32--5",
      "name": "Спальня 5",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -2.7753414154085547,
        "pitch": 0.013522606622441202,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": -0.3854841622449925,
          "pitch": 0.138651067243595,
          "rotation": 0,
          "target": "20----2-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "33--6--",
      "name": "Спальня 6. У входа",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -1.8561240275475157,
        "pitch": -0.0374115650088882,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": -2.331411655854751,
          "pitch": 0.35489568312667075,
          "rotation": 0.7853981633974483,
          "target": "34--6-"
        },
        {
          "yaw": 1.8649242401567996,
          "pitch": 0.13652293977741614,
          "rotation": 0,
          "target": "20----2-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "34--6-",
      "name": "Спальня 6. Центр",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 2.166645588546433,
        "pitch": 0.17610892889844365,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": -2.051176148960776,
          "pitch": 0.454617896409351,
          "rotation": 3.141592653589793,
          "target": "33--6--"
        },
        {
          "yaw": -1.8404992058258145,
          "pitch": 0.1070619000979054,
          "rotation": 0.7853981633974483,
          "target": "20----2-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "35--7",
      "name": "Спальня 7",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -2.747919173652921,
        "pitch": 0.0015114553698438726,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": 1.1842479447428271,
          "pitch": 0.04802799501361221,
          "rotation": 0,
          "target": "20----2-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "36--8",
      "name": "Спальня 8",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 2.5805960141943913,
        "pitch": 0.009766327005088726,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": -2.1797554682506366,
          "pitch": 0.10523399610345763,
          "rotation": 0,
          "target": "20----2-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "37--9--",
      "name": "Спальня 9. У входа",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -3.027038042830096,
        "pitch": 0.02349215707992869,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": -2.753929842521309,
          "pitch": 0.7184867493970852,
          "rotation": 0,
          "target": "38--9--"
        },
        {
          "yaw": 1.1289839305393095,
          "pitch": 0.3021896981881653,
          "rotation": 5.497787143782138,
          "target": "23----3-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "38--9--",
      "name": "Спальня 9. В центре",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 1.8177965696536669,
        "pitch": 0.047056927771636836,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": -1.9915235276907008,
          "pitch": 1.0032585029256698,
          "rotation": 3.141592653589793,
          "target": "37--9--"
        },
        {
          "yaw": -1.6539462014800659,
          "pitch": 0.1803174042380018,
          "rotation": 0,
          "target": "23----3-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "39--10",
      "name": "Спальня 10",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 2.793349927113278,
        "pitch": -0.004333244445151152,
        "fov": 1.53656878213594
      },
      "linkHotspots": [
        {
          "yaw": -0.6277050522038614,
          "pitch": 0.07811361302950104,
          "rotation": 0,
          "target": "23----3-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "40--67---",
      "name": "Санузлы 6.7 в банкетном зале",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -2.9423712177525285,
          "pitch": 0.41018271843476484,
          "rotation": 0,
          "target": "41---"
        },
        {
          "yaw": -2.711231057804522,
          "pitch": 0.1550464912623788,
          "rotation": 4.71238898038469,
          "target": "42-----"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "41---",
      "name": "Банкетный зал. Танцпол",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 3.113364961113394,
        "pitch": -0.030336168129128538,
        "fov": 1.4977453684186188
      },
      "linkHotspots": [
        {
          "yaw": 1.1941733386600788,
          "pitch": 0.1366308372060132,
          "rotation": 0,
          "target": "11----1-"
        },
        {
          "yaw": -2.5130952071454207,
          "pitch": 0.2938473564165758,
          "rotation": 4.71238898038469,
          "target": "42-----"
        },
        {
          "yaw": 0.4008558219484861,
          "pitch": 0.04284475636750429,
          "rotation": 0,
          "target": "40--67---"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.192871157506021,
          "pitch": -0.032906614214562424,
          "title": "Коттедж Сингапур",
          "text": "Банкетный зал и Коттедж Сингапур арендуются отдельно"
        }
      ]
    },
    {
      "id": "42-----",
      "name": "Банкетный зал. У запасного выхода",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 2.726501982647502,
        "pitch": 0.11284345475759494,
        "fov": 1.4977453684186188
      },
      "linkHotspots": [
        {
          "yaw": 2.0181852175207418,
          "pitch": 0.10995242539600092,
          "rotation": 0,
          "target": "11----1-"
        },
        {
          "yaw": 1.6658968959458713,
          "pitch": 0.02877545608912868,
          "rotation": 0,
          "target": "40--67---"
        },
        {
          "yaw": -2.8657071110888914,
          "pitch": -0.06745440623113907,
          "rotation": 5.497787143782138,
          "target": "2---"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 2.018396756275461,
          "pitch": -0.006018673818154241,
          "title": "Коттедж Сингапур",
          "text": "Арендуется отдельно от Банкетного зала"
        }
      ]
    }
  ],
  "name": "Коттедж Сингапур+. ВКинель.ру. VKinel.ru",
  "settings": {
    "mouseViewMode": "drag",
    "autorotateEnabled": true,
    "fullscreenButton": true,
    "viewControlButtons": false
  }
};
