replacer = {
    /* empty */
    'empty': {
        'desc': 'empty',
        'h1': 'empty',
        'h2': 'empty',
        '': ''
    },

    /* avito */
    'avito': {
        '': ''
    },

    /* arendnyj-biznes */
    'arendnyj-biznes': {
        'desc': 'Продажа коттеджного арендного бизнеса в Самарской области за 37 млн. ₽ от собственника',
        'h1': 'Станьте владельцем бизнеса по сдаче в аренду собственных коттеджей',
        'h2': 'Для свадеб, банкетов, юбилеев, корпоративов',
        '': ''
    },

    /* baza-otdyha */
    'baza-otdyha': {
        'desc': 'Продажа базы отдыха в Самарской области за 37 млн. ₽ от собственника',
        'h1': 'Станьте владельцем базы отдыха: получайте прибыль от сдачи в аренду собственных коттеджей',
        'h2': 'Для свадеб, банкетов, юбилеев, корпоративов. Своё производство банкетов',
        '': ''
    },

    /* bez-posrednikov */
    'bez-posrednikov': {
        'desc': 'Продажа от собственника коттеджно-банкетного бизнеса в Самарской области за 37 млн. ₽ ',
        'h1': 'Станьте владельцем бизнеса по сдаче в аренду собственных коттеджей',
        'h2': 'Для свадеб, банкетов, юбилеев, корпоративов. Своё производство банкетов<br><br>Без посредников!<br>Прямая продажа!',
        '': ''
    },

    /* biznes-v-samarskoj-oblasti */
    'biznes-v-samarskoj-oblasti': {
        'h1': 'Станьте владельцем бизнеса по сдаче в аренду собственных коттеджей в Самарской области',
        '': ''
    },

    /* biznes-kupit */
    'biznes-kupit': {
        '': ''
    },

    /* biznes-na-uchastke-v-kottedzhnom-posjolke */
    'biznes-na-uchastke-v-kottedzhnom-posjolke': {
        'h1': 'Станьте владельцем бизнеса по сдаче в аренду собственных коттеджей на участке в коттеджном посёлке',
        '': ''
    },

    /* vlozhite-75-mln-r */
    'vlozhite-75-mln-r': {
        '': ''
    },

    /* vlozhit */
    'vlozhit': {
        '': ''
    },

    /* vygodnyj */
    'vygodnyj': {
        'desc': 'Продажа выгодного коттеджно-банкетного бизнеса в Самарской области за 37 млн. ₽ от собственника',
        'h1': 'Станьте владельцем выгодного бизнеса по сдаче в аренду собственных коттеджей',
        '': ''
    },

    /* gostinica */
    'gostinica': {
        'desc': 'Продажа гостиничного бизнеса в Самарской области за 37 млн. ₽ от собственника',
        'h1': 'Станьте владельцем гостиничного бизнеса по сдаче в аренду собственных коттеджей',
        '': ''
    },

    /* gotovyj-biznes */
    'gotovyj-biznes': {
        'desc': 'Продажа от собственника готового бизнеса: коттеджно-банкетного комплекса в Самарской области за 37 млн. ₽',
        'h1': 'Станьте владельцем готового бизнеса по сдаче в аренду собственных коттеджей',
        '': ''
    },

    /* dejstvujushhij-biznes */
    'dejstvujushhij-biznes': {
        'desc': 'Продажа действующего коттеджно-банкетного бизнеса в Самарской области за 37 млн. ₽ от собственника',
        'h1': 'Станьте владельцем действующего бизнеса по сдаче в аренду собственных коттеджей',
        'h2': 'Для свадеб, банкетов, юбилеев, корпоративов. Своё производство банкетов',
        '': ''
    },

    /* dom-prestarelyh */
    'dom-prestarelyh': {
        'h2': 'Бизнес можно легко перепрофилировать в дом престарелых. Сейчас коттеджи сдаются для свадеб, банкетов, юбилеев, корпоративов. Собственная кухня.',
        '': ''
    },

    /* zolotodobychnoj */
    'zolotodobychnoj': {
        'h1': 'Интересуетесь золотодобычным бизнесом?<br><br>Изучите альтернативу!<br>Узнайте, насколько выгоднее быть владельцем бизнеса по сдаче в аренду собственных коттеджей',
        'h2': 'Прочитайте этот сайт до конца и оцените, насколько предлагаемый арендный бизнес лучше, чем бизнес в сфере золотодобычи.',
        '': ''
    },

    /* investirovat */
    'investirovat': {
        'h1': 'Инвестируйте в покупку стабильного бизнеса по сдаче в аренду собственных коттеджей',
        '': ''
    },

    /* kommercheskaja-nedvizhimost-s-arendatorom */
    'kommercheskaja-nedvizhimost-s-arendatorom': {
        'desc': 'Продажа недвижимости с арендаторами в Самарской области за 37 млн. ₽ от собственника',
        'h1': 'Продаются коттеджи для сдачи в аренду',
        'h2': 'Для свадеб, банкетов, юбилеев, корпоративов. Своё производство банкетов<br><br>Постоянный поток арендаторов!',
        '': ''
    },

    /* kottedzhnyj-posjolok */
    'kottedzhnyj-posjolok': {
        'desc': 'Продажа арендного бизнеса в коттеджном посёлке от собственника за 37 млн. ₽ в Самарской области',
        '': ''
    },

    /* kupit-kottedzhnyj-posjolok */
    'kupit-kottedzhnyj-posjolok': {
        'desc': 'Продажа арендного бизнеса в коттеджном посёлке от собственника за 37 млн. ₽ в Самарской области',
        'h1': 'Купите бизнес по сдаче в аренду собственных домов в коттеджном посёлке',
        '': ''
    },

    /* kupit-dom */
    'kupit-dom': {
        'desc': 'Продажа коттеджно-банкетного бизнеса в Самарской области за 37 млн. ₽ от собственника',
        'h1': 'Купите дома, приносящие доход от сдачи в аренду',
        '': ''
    },

    /* kupit-dom-s-biznesom */
    'kupit-dom-s-biznesom': {
        'desc': 'Продажа домов с бизнесом: коттеджный комплекс в Самарской области за 37 млн. ₽ от собственника',
        'h1': 'Купите дома с арендным бизнесом',
        'h2': 'Для свадеб, банкетов, юбилеев, корпоративов.',
        '': ''
    },

    /* kupit-zavod */
    'kupit-zavod': {
        'h1': 'Хотите купить завод?<br><br>Изучите альтернативу!<br>Узнайте, насколько выгоднее быть владельцем бизнеса по сдаче в аренду собственных коттеджей',
        'h2': 'Прочитайте этот сайт до конца и оцените, насколько предлагаемый арендный бизнес лучше, чем завод',
        '': ''
    },

    /* kupit-kottedzhi-dlja-sdachi */
    'kupit-kottedzhi-dlja-sdachi': {
        'desc': 'Продажа коттеджей для сдачи в Самарской области за 37 млн. ₽ от собственника',
        'h1': 'Купите коттеджи для сдачи в аренду',
        'h2': 'Для свадеб, банкетов, юбилеев, корпоративов. Своё производство банкетов',
        '': ''
    },

    /* kupit-kottedzhnyj-kompleks */
    'kupit-kottedzhnyj-kompleks': {
        'desc': 'Продажа коттеджно-банкетного комплекса в Самарской области за 37 млн. ₽ от собственника',
        'h1': 'Станьте владельцем коттеджного комплекса. Получайте доход от аренды собственных коттеджей',
        '': ''
    },

    /* nedvizhimost */
    'nedvizhimost': {
        'desc': 'Продажа недвижимости: арендного бизнеса в Самарской области за 37 млн. ₽ от собственника',
        'h1': 'Станьте владельцем бизнеса по сдаче в аренду собственной недвижимости: коттеджей, банкетных залов, бани, сауны',
        '': ''
    },

    /* nedvizhimost-dlja-biznesa */
    'nedvizhimost-dlja-biznesa': {
        'desc': 'Продажа недвижимости: купите готовый бизнес в Самарской области за 37 млн. ₽ от собственника',
        'h1': 'Станьте владельцем бизнеса по сдаче в аренду собственной недвижимости: коттеджей, банкетных залов, сауны, бани',
        'h2': 'Для свадеб, банкетов, юбилеев, корпоративов',
        '': ''
    },

    /* nedvizhimost-kak-biznes */
    'nedvizhimost-kak-biznes': {
        'desc': 'Продажа недвижимости: купите готовый бизнес в Самарской области за 37 млн. ₽ от собственника',
        'h1': 'Станьте владельцем бизнеса по сдаче в аренду собственной недвижимости: коттеджей, банкетных залов, сауны, бани',
        'h2': 'Для свадеб, банкетов, юбилеев, корпоративов',
        '': ''
    },

    /* nedvizhimost-pod-biznes */
    'nedvizhimost-pod-biznes': {
        'desc': 'Продажа недвижимости: купите готовый бизнес в Самарской области за 37 млн. ₽ от собственника',
        'h1': 'Станьте владельцем бизнеса по сдаче в аренду собственной недвижимости: коттеджей, банкетных залов, сауны, бани',
        'h2': 'Для свадеб, банкетов, юбилеев, корпоративов',
        '': ''
    },

    /* obshhepit */
    'obshhepit': {
        'desc': 'Продажа коттеджно-банкетного бизнеса в Самарской области за 37 млн. ₽ от собственника',
        'h1': 'Станьте владельцем бизнеса в сфере общественного питания и сдачи в аренду собственных коттеджей',
        'h2': 'Для свадеб, банкетов, юбилеев, корпоративов. Своё производство банкетов',
        '': ''
    },
    /* restoran */
    'restoran': {
        'desc': 'Продажа ресторанно-коттеджного бизнеса в Самарской области за 37 млн. ₽ от собственника',
        'h1': 'Станьте владельцем бизнеса по приготовлению банкетов и сдаче в аренду собственных коттеджей',
        'h2': 'Для свадеб, банкетов, юбилеев, корпоративов. Своё производство банкетов',
        '': ''
    },
    /* stolovaja */
    'stolovaja': {
        'desc': 'Продажа коттеджно-столового бизнеса в Самарской области за 37 млн. ₽ от собственника',
        'h1': 'Станьте владельцем бизнеса по приготовлению еды и сдаче в аренду собственных коттеджей',
        'h2': 'Для свадеб, банкетов, юбилеев, корпоративов. Своя кухня',
        '': ''
    },

    /* otel */
    'otel': {
        'desc': 'Продажа отеля в Самарской области за 37 млн. ₽ от собственника',
        'h1': 'Станьте владельцем загородного отеля. Получайте доход от аренды собственных коттеджей',
        'h2': 'Гости приезжают на свадьбы, банкеты, юбилеи, корпоративы. Есть своё производство банкетов',
        '': ''
    },
    /* hostel */
    'hostel': {
        'desc': 'Продажа хостела в Самарской области за 37 млн. ₽ от собственника',
        'h1': 'Станьте владельцем загородного хостела. Получайте доход от аренды собственных коттеджей',
        'h2': 'Гости приезжают на свадьбы, банкеты, юбилеи, корпоративы. Есть своё производство банкетов',
        '': ''
    },
    /* turbaza */
    'turbaza': {
        'desc': 'Продажа турбазы в Самарской области за 37 млн. ₽ от собственника',
        'h1': 'Станьте владельцем турбазы. Получайте прибыль от аренды собственных коттеджей',
        'h2': 'Гости приезжают на свадьбы, банкеты, юбилеи, корпоративы. Своё производство банкетов',
        '': ''
    },

    /* proizvodstvo */
    'proizvodstvo': {
        'desc': 'Продажа бизнеса в Самарской области за 37 млн. ₽ от собственника',
        'h1': 'Хотите производство?<br><br>Рассмотрите альтернативу!<br>Узнайте, насколько выгоднее быть владельцем бизнеса по сдаче в аренду собственных коттеджей',
        'h2': 'Прочитайте этот сайт до конца и оцените, насколько предлагаемый бизнес лучше, чем производственный',
        '': ''
    },

    /* samara */
    'samara': {
        '': ''
    },

    /* sobstvennik */
    'sobstvennik': {
        '': ''
    },

    /* franshiza */
    'franshiza': {
        'desc': 'Продажа готового коттеджно-банкетного бизнеса в Самарской области за 37 млн. ₽ от собственника',
        'h1': 'Станьте владельцем отлаженного готового бизнеса по сдаче в аренду собственных коттеджей',
        'h2': 'Для свадеб, банкетов, юбилеев, корпоративов. Своё производство банкетов<br><br>Получите годовую поддержку после покупки бизнеса',
        '': ''
    },

    /* shirokij */
    'shirokij': {
        'desc': 'Продажа бизнеса в Самарской области за 37 млн. ₽ от собственника',
        'h1': 'Станьте владельцем бизнеса по сдаче в аренду собственных коттеджей',
        'h2': 'Для свадеб, банкетов, юбилеев, корпоративов. Своё производство банкетов',
        '': ''
    },
    /* 1 */
    'standard': {
        'desc': 'Продажа бизнеса в Самарской области за 37 млн. ₽ от собственника',
        'h1': 'Станьте владельцем бизнеса по сдаче в аренду собственных коттеджей',
        'h2': 'Для свадеб, банкетов, юбилеев, корпоративов. Своё производство банкетов',
        '': ''
    },

    /*  Script will search for this text and replace it to the new texts */
    'original_texts': {
        /* key - unique original text id,
         v *alue* - array:
         zero-index is method of search-and-replace:
         0 - default method - just change HTML code in body
         1 - safety find text elements, change text only inside text elements
         first index is original text (script will search for this text)

         If original text is long and uniq - use default method #0,
         if original text is short and can be inside attributes - use method #1
             */
        'desc': [0, 'Продажа бизнеса в Самарской области за 37 млн. ₽ от собственника'],
        'h1': [0, 'Станьте владельцем бизнеса по сдаче в аренду собственных коттеджей с прибылью 13,000,000₽ в год'],
        'h2': [0, 'Для свадеб, банкетов, юбилеев, корпоративов. Своё производство банкетов'],
        '': ''
    }
};

/* Copyright (c) 2025 Borodin-Atamanov */


function replace_after_page_loaded() 
{
    /*  parse GET parameters */
    var query = get_query_params(document.location.search);
    /* Replace text on the page */
    replace_everything(query.q, replacer);

    /* add unbreakable space before short words */
    replace_html(' ₽', '&nbsp;₽');
    replace_html(' млн.', '&nbsp;млн.');
    replace_html(' шт.', '&nbsp;шт.');
    replace_html(' м²', '&nbsp;м²');
    
    add_nbsp_after_short_word('к');
    add_nbsp_after_short_word('о');
    add_nbsp_after_short_word('а');
    add_nbsp_after_short_word('и');
    add_nbsp_after_short_word('в');
    add_nbsp_after_short_word('с');
    add_nbsp_after_short_word('у');
    add_nbsp_after_short_word('из');
    add_nbsp_after_short_word('за');
    add_nbsp_after_short_word('от');
    add_nbsp_after_short_word('до');
    add_nbsp_after_short_word('по');
    add_nbsp_after_short_word('со');
    add_nbsp_after_short_word('не');
    add_nbsp_after_short_word('ни');
    add_nbsp_after_short_word('на');
    add_nbsp_after_short_word('но');
    add_nbsp_after_short_word('вы');

    // &nbsp; after any digit
    replace_text(document.body, '1 ', '1\xA0');
    replace_text(document.body, '2 ', '2\xA0'); 
    replace_text(document.body, '3 ', '3\xA0'); 
    replace_text(document.body, '4 ', '4\xA0'); 
    replace_text(document.body, '5 ', '5\xA0'); 
    replace_text(document.body, '6 ', '6\xA0'); 
    replace_text(document.body, '7 ', '7\xA0'); 
    replace_text(document.body, '8 ', '8\xA0'); 
    replace_text(document.body, '9 ', '9\xA0'); 
    replace_text(document.body, '0 ', '0\xA0'); 

    console.log('replace_after_page_loaded() 202503');
}
if (document.readyState !== 'loading') {
    console.log('document.readyState replace_after_page_loaded');
    replace_after_page_loaded() 
} else {
    document.addEventListener('DOMContentLoaded', function () {
        console.log('DOMContentLoaded replace_after_page_loaded');
        replace_after_page_loaded() 
    });
}
