var APP_DATA = {
  "scenes": [
    {
      "id": "0--1--",
      "name": "Зал 1. У входа",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -3.1341168046410672,
        "pitch": 0.00345751337334832,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": -1.861579789253387,
          "pitch": -0.01833301935997511,
          "rotation": 3.141592653589793,
          "target": "2--1--"
        },
        {
          "yaw": 1.9943515601445423,
          "pitch": 0.3373225693027564,
          "rotation": 2.356194490192345,
          "target": "1--1--"
        },
        {
          "yaw": 2.549822489985093,
          "pitch": -0.007009463769060531,
          "rotation": 1.5707963267948966,
          "target": "4--2--"
        },
        {
          "yaw": -2.5393551335664757,
          "pitch": -0.035073840551829605,
          "rotation": 4.71238898038469,
          "target": "6--2--"
        },
        {
          "yaw": 3.112616444289804,
          "pitch": 0.011979370882194473,
          "rotation": 2.356194490192345,
          "target": "3--1--"
        },
        {
          "yaw": -0.08677273673313479,
          "pitch": 0.48248711742329853,
          "rotation": 3.141592653589793,
          "target": "19------"
        },
        {
          "yaw": -0.4422332522847192,
          "pitch": 0.2252109761544343,
          "rotation": 0,
          "target": "20---"
        },
        {
          "yaw": 0.21446870888000902,
          "pitch": 0.05588764792847911,
          "rotation": 6.283185307179586,
          "target": "18----"
        },
        {
          "yaw": 0.08144247489948775,
          "pitch": -0.2251074070367025,
          "rotation": 4.71238898038469,
          "target": "38--7"
        },
        {
          "yaw": 0.2306765760723941,
          "pitch": -0.21497097645771213,
          "rotation": 1.5707963267948966,
          "target": "40--8--"
        },
        {
          "yaw": -0.12321794705323441,
          "pitch": 0.15486879764860362,
          "rotation": 2.356194490192345,
          "target": "23---"
        },
        {
          "yaw": 0.16851221506155944,
          "pitch": -0.10271109191052119,
          "rotation": 0,
          "target": "36--5--6-"
        },
        {
          "yaw": -0.09544700214442692,
          "pitch": -0.5942360147150882,
          "rotation": 0,
          "target": "17---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "1--1--",
      "name": "Зал 1. Кухонная зона",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -3.1056937507960196,
        "pitch": 0.010152485815222434,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": 1.8231422679140588,
          "pitch": 0.22260348327277768,
          "rotation": 1.5707963267948966,
          "target": "4--2--"
        },
        {
          "yaw": -2.65795604091492,
          "pitch": 0.3157939155092464,
          "rotation": 4.71238898038469,
          "target": "0--1--"
        },
        {
          "yaw": 3.115792427816899,
          "pitch": -0.012169638251798176,
          "rotation": 3.141592653589793,
          "target": "2--1--"
        },
        {
          "yaw": 2.6447268506181345,
          "pitch": 0.1013689136104361,
          "rotation": 7.853981633974483,
          "target": "3--1--"
        },
        {
          "yaw": 2.7580872998584995,
          "pitch": 0.035183304406356086,
          "rotation": 4.71238898038469,
          "target": "6--2--"
        },
        {
          "yaw": -2.491713195975583,
          "pitch": 0.06859657047138334,
          "rotation": 3.9269908169872414,
          "target": "19------"
        },
        {
          "yaw": -2.5013670513393684,
          "pitch": -0.07867932177420478,
          "rotation": 0,
          "target": "20---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "2--1--",
      "name": "Зал 1. У окон",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 3.0831421440030926,
        "pitch": -0.09405126881772041,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": 2.7635176403597725,
          "pitch": 0.19967675830524634,
          "rotation": 1.5707963267948966,
          "target": "0--1--"
        },
        {
          "yaw": 3.0651714449646956,
          "pitch": 0.08779272325337573,
          "rotation": 3.141592653589793,
          "target": "1--1--"
        },
        {
          "yaw": -2.4445106575423257,
          "pitch": 0.16310636676112011,
          "rotation": 7.853981633974483,
          "target": "6--2--"
        },
        {
          "yaw": -2.965384141658749,
          "pitch": 0.040195756167468844,
          "rotation": 1.5707963267948966,
          "target": "4--2--"
        },
        {
          "yaw": -2.8110637707024146,
          "pitch": 0.17347791539395807,
          "rotation": 4.71238898038469,
          "target": "3--1--"
        },
        {
          "yaw": 2.6709056346909748,
          "pitch": 0.19383069970072597,
          "rotation": 4.71238898038469,
          "target": "19------"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "3--1--",
      "name": "Зал 1. У камина",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 2.7089801556689626,
        "pitch": 0.018659997422719954,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": -1.3560704451687382,
          "pitch": 0.48450954408356317,
          "rotation": 3.9269908169872414,
          "target": "1--1--"
        },
        {
          "yaw": -2.6548705979947282,
          "pitch": 0.41040013298465716,
          "rotation": 3.141592653589793,
          "target": "0--1--"
        },
        {
          "yaw": 2.4669053476811422,
          "pitch": 0.016896827153191296,
          "rotation": 3.141592653589793,
          "target": "2--1--"
        },
        {
          "yaw": 2.0345043403583523,
          "pitch": 0.21390472740580968,
          "rotation": 5.497787143782138,
          "target": "6--2--"
        },
        {
          "yaw": -0.2562461785112138,
          "pitch": 0.2984417879515835,
          "rotation": 7.0685834705770345,
          "target": "4--2--"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "4--2--",
      "name": "Зал 2. У входа",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 2.470028558296198,
        "pitch": -0.006359701470149304,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": 3.1333380180886587,
          "pitch": 0.217237417386567,
          "rotation": 3.141592653589793,
          "target": "6--2--"
        },
        {
          "yaw": 1.964397876946709,
          "pitch": 0.2742922523454876,
          "rotation": 0,
          "target": "15--"
        },
        {
          "yaw": -3.1307219182225143,
          "pitch": 0.5111160259752285,
          "rotation": 0,
          "target": "5--2-"
        },
        {
          "yaw": -2.0621547576387584,
          "pitch": 0.20222644680270108,
          "rotation": 3.141592653589793,
          "target": "0--1--"
        },
        {
          "yaw": -2.054890257453417,
          "pitch": 0.0627962029624225,
          "rotation": 9.42477796076938,
          "target": "19------"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.2623178364187098,
          "pitch": 0.009886449544055154,
          "title": "Вход в сауну",
          "text": "Сауна сдаётся отдельно"
        }
      ]
    },
    {
      "id": "5--2-",
      "name": "Зал 2. Центр",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -2.2806041547849585,
        "pitch": 0.014409448283018378,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": -2.3864152141158463,
          "pitch": 0.2590344806848357,
          "rotation": 12.566370614359176,
          "target": "6--2--"
        },
        {
          "yaw": 0.8800665992640297,
          "pitch": 0.5344862777307338,
          "rotation": 3.141592653589793,
          "target": "4--2--"
        },
        {
          "yaw": -0.35711053092920686,
          "pitch": 0.15282666649961385,
          "rotation": 0,
          "target": "1--1--"
        },
        {
          "yaw": 1.8904876814690326,
          "pitch": 0.23405002283920773,
          "rotation": 0,
          "target": "15--"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.5542548914187151,
          "pitch": -0.021388465347509822,
          "title": "Сауна",
          "text": "Арендуется отдельно"
        }
      ]
    },
    {
      "id": "6--2--",
      "name": "Зал 2. У окон",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -2.9325660726111167,
        "pitch": 0.020866396062471537,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": 1.0656234170225503,
          "pitch": 0.18054255637764527,
          "rotation": 0,
          "target": "4--2--"
        },
        {
          "yaw": 1.4826216867403241,
          "pitch": 0.028511583766565707,
          "rotation": 1.5707963267948966,
          "target": "15--"
        },
        {
          "yaw": 1.0846337056688924,
          "pitch": 0.375894502732141,
          "rotation": 0,
          "target": "5--2-"
        },
        {
          "yaw": -0.48649589163133555,
          "pitch": 0.12841068523758992,
          "rotation": 1.5707963267948966,
          "target": "2--1--"
        },
        {
          "yaw": 0.6749112740186973,
          "pitch": 0.057400124582006384,
          "rotation": 4.71238898038469,
          "target": "1--1--"
        },
        {
          "yaw": -2.4607656454173217,
          "pitch": 0.08015348146870593,
          "rotation": 3.141592653589793,
          "target": "11---"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.9456722676860245,
          "pitch": -0.0023292737071898273,
          "title": "Вход в сауну",
          "text": "Сауна сдаётся отдельно"
        }
      ]
    },
    {
      "id": "7---",
      "name": "Площадка. У бани",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 0.8973027149421284,
        "pitch": 0.008476791674176809,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": 2.3450326987125614,
          "pitch": -0.1066060080365272,
          "rotation": 0,
          "target": "15--"
        },
        {
          "yaw": 0.8800565149723596,
          "pitch": 0.04125977521027124,
          "rotation": 0,
          "target": "10--"
        },
        {
          "yaw": 0.7662776399357387,
          "pitch": 0.21345999962174744,
          "rotation": 0,
          "target": "9---"
        },
        {
          "yaw": -0.9468733717530373,
          "pitch": 0.19306569968702014,
          "rotation": 0,
          "target": "48------"
        },
        {
          "yaw": -0.9207997476207179,
          "pitch": -0.058378710740036865,
          "rotation": 0,
          "target": "49------"
        },
        {
          "yaw": 1.3074801693437124,
          "pitch": 0.10138772766547532,
          "rotation": 5.497787143782138,
          "target": "8--"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -2.7353064331640873,
          "pitch": 0.0985007722250053,
          "title": "Русская баня",
          "text": "Арендуется отдельно"
        }
      ]
    },
    {
      "id": "8--",
      "name": "У беседки",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -2.483532632540136,
        "pitch": 0.022125577841922706,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": 2.714994885058463,
          "pitch": -0.02948483688275161,
          "rotation": 0,
          "target": "15--"
        },
        {
          "yaw": -3.055220701406636,
          "pitch": 0.11568246228364032,
          "rotation": 0,
          "target": "7---"
        },
        {
          "yaw": -2.0841697663115237,
          "pitch": 0.26855321120753395,
          "rotation": 0,
          "target": "9---"
        },
        {
          "yaw": -1.748779856526923,
          "pitch": 0.21434406627832914,
          "rotation": 0,
          "target": "10--"
        },
        {
          "yaw": -2.630517344658509,
          "pitch": 0.052435498131449876,
          "rotation": 7.0685834705770345,
          "target": "48------"
        },
        {
          "yaw": 1.1568805195489453,
          "pitch": -0.7144407246583064,
          "rotation": 4.71238898038469,
          "target": "33--3---"
        },
        {
          "yaw": 1.1523468090472342,
          "pitch": -0.04993081616511574,
          "rotation": 1.5707963267948966,
          "target": "16-"
        },
        {
          "yaw": 0.4408305021837329,
          "pitch": 0.08133642442513178,
          "rotation": 0.7853981633974483,
          "target": "12-----"
        },
        {
          "yaw": -0.48611459789470857,
          "pitch": 0.19102208288004796,
          "rotation": 3.141592653589793,
          "target": "11---"
        },
        {
          "yaw": 1.887344679354256,
          "pitch": -0.6873624510768366,
          "rotation": 0,
          "target": "6--2--"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 2.9439754190674243,
          "pitch": -0.1407903921132707,
          "title": "Русская баня",
          "text": "Арендуется отдельно"
        }
      ]
    },
    {
      "id": "9---",
      "name": "Площадка. У беседки",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "pitch": 0,
        "yaw": 0,
        "fov": 1.5707963267948966
      },
      "linkHotspots": [
        {
          "yaw": -0.17817573684256516,
          "pitch": 0.1403149836424511,
          "rotation": 0,
          "target": "7---"
        },
        {
          "yaw": -0.7795196176080061,
          "pitch": -0.07001894152118382,
          "rotation": 0,
          "target": "15--"
        },
        {
          "yaw": 2.392689290074708,
          "pitch": 0.4112539528488135,
          "rotation": 0,
          "target": "10--"
        },
        {
          "yaw": -2.198701881237877,
          "pitch": 0.22710497648824024,
          "rotation": 0,
          "target": "8--"
        },
        {
          "yaw": 0.43434437821677996,
          "pitch": 0.05169291366470041,
          "rotation": 7.853981633974483,
          "target": "48------"
        },
        {
          "yaw": -1.7421265960821053,
          "pitch": -0.19655595347522947,
          "rotation": 0,
          "target": "6--2--"
        },
        {
          "yaw": -1.3168896351576738,
          "pitch": -0.24629189948687547,
          "rotation": 0,
          "target": "5--2-"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.3597315617231054,
          "pitch": -0.04619240071942521,
          "title": "Русская баня",
          "text": "Сдаётся отдельно"
        },
        {
          "yaw": 0.8580560089205242,
          "pitch": 0.1226100636813765,
          "title": "Мангальная площадка",
          "text": "Уголь и розжиг приобретается самостоятельно"
        }
      ]
    },
    {
      "id": "10--",
      "name": "В беседке",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 0.5042892528618381,
        "pitch": -0.023311177103961356,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": -3.0263738471721204,
          "pitch": 0.6634045268023705,
          "rotation": 0,
          "target": "9---"
        },
        {
          "yaw": 3.0691494929896317,
          "pitch": 0.1617632050788096,
          "rotation": 0,
          "target": "7---"
        },
        {
          "yaw": 1.6876744489949367,
          "pitch": 0.258116336331474,
          "rotation": 0,
          "target": "8--"
        },
        {
          "yaw": 2.5681450171142144,
          "pitch": -0.0538611278445007,
          "rotation": 0,
          "target": "15--"
        },
        {
          "yaw": -2.8869034383028733,
          "pitch": 0.08459516031586034,
          "rotation": 1.5707963267948966,
          "target": "48------"
        },
        {
          "yaw": 2.2133316315388747,
          "pitch": -0.1692020896030293,
          "rotation": 0,
          "target": "6--2--"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 2.85995773180297,
          "pitch": -0.11931782107529543,
          "title": "Русская баня",
          "text": "Арендуется отдельно"
        }
      ]
    },
    {
      "id": "11---",
      "name": "Груша у беседки",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -2.675460862284906,
        "pitch": -0.008745041689348199,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": 2.363679622508087,
          "pitch": 0.04667900338803754,
          "rotation": 1.5707963267948966,
          "target": "13---"
        },
        {
          "yaw": 2.2987312144095693,
          "pitch": 0.2213813563741116,
          "rotation": 1.5707963267948966,
          "target": "12-----"
        },
        {
          "yaw": 2.5389744211210346,
          "pitch": -0.025584325154031973,
          "rotation": 2.356194490192345,
          "target": "52---"
        },
        {
          "yaw": 1.8483983354464364,
          "pitch": -0.04222328049922375,
          "rotation": 1.5707963267948966,
          "target": "14-----"
        },
        {
          "yaw": 2.9659477161600014,
          "pitch": -0.10284105105357355,
          "rotation": 1.5707963267948966,
          "target": "16-"
        },
        {
          "yaw": -2.6390696805716516,
          "pitch": -0.184461842203822,
          "rotation": 0,
          "target": "6--2--"
        },
        {
          "yaw": 3.139980377804818,
          "pitch": -0.1233908623543769,
          "rotation": 0,
          "target": "2--1--"
        },
        {
          "yaw": 2.949627827198416,
          "pitch": -0.3597862958304212,
          "rotation": 0.7853981633974483,
          "target": "33--3---"
        },
        {
          "yaw": -1.3169722590693702,
          "pitch": -0.1354641986342493,
          "rotation": 0,
          "target": "10--"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "12-----",
      "name": "В саду у парадного входа",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -2.743568620000225,
        "pitch": -0.2606608424123973,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": -3.11809919651839,
          "pitch": -0.12302003252179183,
          "rotation": 0,
          "target": "16-"
        },
        {
          "yaw": 3.122424287122473,
          "pitch": -0.5037261341327977,
          "rotation": 3.141592653589793,
          "target": "33--3---"
        },
        {
          "yaw": -1.2602700665246704,
          "pitch": -0.030549059746348917,
          "rotation": 0,
          "target": "10--"
        },
        {
          "yaw": -1.6117437875902851,
          "pitch": 0.10133741329160273,
          "rotation": 3.141592653589793,
          "target": "8--"
        },
        {
          "yaw": -0.8189523168746327,
          "pitch": 0.21673648487447394,
          "rotation": 10.210176124166829,
          "target": "11---"
        },
        {
          "yaw": -2.6941191704906817,
          "pitch": -0.1823926441253203,
          "rotation": 0,
          "target": "2--1--"
        },
        {
          "yaw": -1.9723532031920783,
          "pitch": -0.1704273725647827,
          "rotation": 0,
          "target": "6--2--"
        },
        {
          "yaw": 2.4879932625370023,
          "pitch": 0.0043153265728257395,
          "rotation": 4.71238898038469,
          "target": "51---"
        },
        {
          "yaw": 1.764336607585557,
          "pitch": -0.07001837007555167,
          "rotation": 1.5707963267948966,
          "target": "14-----"
        },
        {
          "yaw": 1.9272304984599726,
          "pitch": 0.13905261253485435,
          "rotation": 7.853981633974483,
          "target": "13---"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -2.703494542702625,
          "pitch": -0.6204088530034664,
          "title": "Коттедж Ливерпуль",
          "text": "Часть коттеджно-банкетного комплекса VKinel.ru"
        }
      ]
    },
    {
      "id": "13---",
      "name": "У калитки входной",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 3.030579659624168,
        "pitch": -0.0290297854105237,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": 3.0197918761431897,
          "pitch": -0.3625875150742335,
          "rotation": 3.141592653589793,
          "target": "33--3---"
        },
        {
          "yaw": 3.067706766777409,
          "pitch": -0.07842194640247158,
          "rotation": 0,
          "target": "16-"
        },
        {
          "yaw": -2.5662326349889213,
          "pitch": 0.12674918162313098,
          "rotation": 5.497787143782138,
          "target": "12-----"
        },
        {
          "yaw": -2.9428133232462717,
          "pitch": -0.0792400053928155,
          "rotation": 0,
          "target": "2--1--"
        },
        {
          "yaw": -2.6733115370661995,
          "pitch": -0.06940825476631218,
          "rotation": 0,
          "target": "6--2--"
        },
        {
          "yaw": 1.6400422741030027,
          "pitch": 0.03707113926923711,
          "rotation": 3.141592653589793,
          "target": "52---"
        },
        {
          "yaw": 2.3110611680128814,
          "pitch": 0.0365445116302503,
          "rotation": 3.141592653589793,
          "target": "51---"
        },
        {
          "yaw": 0.008190858983068594,
          "pitch": 0.08279597186627186,
          "rotation": 3.141592653589793,
          "target": "14-----"
        },
        {
          "yaw": 1.0638466614863553,
          "pitch": -0.019248941741343728,
          "rotation": 1.5707963267948966,
          "target": "14-----"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "14-----",
      "name": "Вид с улицы на Ливерпуль",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 2.9741131333683075,
        "pitch": -0.021685711169576294,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": -3.0258279220240585,
          "pitch": 0.15540455197222158,
          "rotation": 11.780972450961727,
          "target": "13---"
        },
        {
          "yaw": 1.931981274888475,
          "pitch": -0.014347928825348077,
          "rotation": 0,
          "target": "51---"
        },
        {
          "yaw": -2.7146288429280396,
          "pitch": 0.02156094589120272,
          "rotation": 5.497787143782138,
          "target": "12-----"
        },
        {
          "yaw": 2.9229120895866814,
          "pitch": -0.06660967496672576,
          "rotation": 4.71238898038469,
          "target": "16-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "15--",
      "name": "Заднее крыльцо",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 2.217472563484918,
        "pitch": 0.01807452796083453,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": -0.46151144732225546,
          "pitch": 0.38234490839705515,
          "rotation": 0,
          "target": "4--2--"
        },
        {
          "yaw": -1.0421806130964821,
          "pitch": 0.10141972372378305,
          "rotation": 10.995574287564278,
          "target": "1--1--"
        },
        {
          "yaw": 1.9188313290734715,
          "pitch": 0.46877767983017904,
          "rotation": 0,
          "target": "7---"
        },
        {
          "yaw": -3.023710361265973,
          "pitch": 0.1930409674186926,
          "rotation": 0,
          "target": "10--"
        },
        {
          "yaw": 2.9961523929619256,
          "pitch": 0.326135948278127,
          "rotation": 0,
          "target": "8--"
        },
        {
          "yaw": 1.9397445957806223,
          "pitch": 0.2482798335889953,
          "rotation": 0,
          "target": "48------"
        },
        {
          "yaw": 1.959597182362975,
          "pitch": 0.015411354872030714,
          "rotation": 0,
          "target": "49------"
        },
        {
          "yaw": -2.6642422890729502,
          "pitch": 0.279920427015961,
          "rotation": 0.7853981633974483,
          "target": "8--"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.32678514389624,
          "pitch": 0.17617058059020252,
          "title": "Русская баня",
          "text": "Арендуется отдельно"
        }
      ]
    },
    {
      "id": "16-",
      "name": "Тамбур",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 3.1306979177955387,
        "pitch": 0.08749278573013619,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": 2.9857676205146078,
          "pitch": 0.43844975056717495,
          "rotation": 0.7853981633974483,
          "target": "20---"
        },
        {
          "yaw": -3.002877905479341,
          "pitch": 0.23099821280330346,
          "rotation": 1.5707963267948966,
          "target": "19------"
        },
        {
          "yaw": 2.967781864808723,
          "pitch": 0.020116087478189826,
          "rotation": 5.497787143782138,
          "target": "18----"
        },
        {
          "yaw": -0.26650398710224543,
          "pitch": 0.2224849289196733,
          "rotation": 3.141592653589793,
          "target": "12-----"
        },
        {
          "yaw": 0.04283543264213918,
          "pitch": 0.17502661468380154,
          "rotation": 3.9269908169872414,
          "target": "13---"
        },
        {
          "yaw": 0.1171070108853165,
          "pitch": -1.2086542887779288,
          "rotation": 0,
          "target": "33--3---"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -3.081840517631086,
          "pitch": 0.06481410747153227,
          "title": "Санузел",
          "text": "С ванной и биде"
        }
      ]
    },
    {
      "id": "17---",
      "name": "Холл. Второй этаж",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -2.5419525577151525,
        "pitch": 0.041386901121191144,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": -0.8372193502870022,
          "pitch": 0.44152442981745743,
          "rotation": 0,
          "target": "29--1--"
        },
        {
          "yaw": -1.924190393603606,
          "pitch": -0.05724797699631701,
          "rotation": 1.5707963267948966,
          "target": "31--2-"
        },
        {
          "yaw": 0.5976319881999519,
          "pitch": 0.35065836996767885,
          "rotation": 0,
          "target": "32--3"
        },
        {
          "yaw": -2.2608246004348835,
          "pitch": -0.054417779163902225,
          "rotation": 0,
          "target": "47--2---"
        },
        {
          "yaw": 2.423566724992665,
          "pitch": -0.35112417311589894,
          "rotation": 0,
          "target": "34--4"
        },
        {
          "yaw": -2.8524061017371807,
          "pitch": -0.15135162625719722,
          "rotation": 4.71238898038469,
          "target": "36--5--6-"
        },
        {
          "yaw": 3.086845762441646,
          "pitch": 0.5241862948200087,
          "rotation": 1.5707963267948966,
          "target": "21-----7--8-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "18----",
      "name": "Вестибюль. Вид с лестницы",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -3.096997535483391,
        "pitch": 0.4247305374586592,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": -0.9916071627203351,
          "pitch": -0.07830035870100005,
          "rotation": 0,
          "target": "38--7"
        },
        {
          "yaw": -0.46287320019735745,
          "pitch": -0.07013589406132148,
          "rotation": 0,
          "target": "39--8--"
        },
        {
          "yaw": -0.8819578000977266,
          "pitch": 0.4555656373475223,
          "rotation": 3.9269908169872414,
          "target": "21-----7--8-"
        },
        {
          "yaw": 2.8629777545244153,
          "pitch": -0.8148427127366062,
          "rotation": 0,
          "target": "17---"
        },
        {
          "yaw": -2.741870272502622,
          "pitch": 0.3658060817598141,
          "rotation": 0,
          "target": "16-"
        },
        {
          "yaw": -2.4972297051125167,
          "pitch": 0.4069643327995003,
          "rotation": 3.9269908169872414,
          "target": "20---"
        },
        {
          "yaw": -2.226687348944875,
          "pitch": 0.975261311604541,
          "rotation": 3.141592653589793,
          "target": "23---"
        },
        {
          "yaw": 2.5520387196109233,
          "pitch": 0.7103156979882055,
          "rotation": 0,
          "target": "19------"
        },
        {
          "yaw": 2.5433209150499856,
          "pitch": 0.4716686551513156,
          "rotation": 0,
          "target": "0--1--"
        },
        {
          "yaw": 2.472130693595169,
          "pitch": 0.1927172172662246,
          "rotation": 3.141592653589793,
          "target": "3--1--"
        },
        {
          "yaw": 2.7126502118544265,
          "pitch": 0.11205588573965208,
          "rotation": 5.497787143782138,
          "target": "6--2--"
        },
        {
          "yaw": -2.49542603722041,
          "pitch": -0.7469324250107796,
          "rotation": 0,
          "target": "17---"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.5827455575797496,
          "pitch": 0.4687040180809703,
          "title": "Санузел",
          "text": "С ванной и биде"
        }
      ]
    },
    {
      "id": "19------",
      "name": "Вестибюль. У входа в банкетный зал",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -3.0040413960050323,
        "pitch": 0.015282107083663732,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": 2.7390557526916837,
          "pitch": 0.6700265532993761,
          "rotation": 0,
          "target": "0--1--"
        },
        {
          "yaw": 2.4945041225872293,
          "pitch": 0.17370783685031022,
          "rotation": 2.356194490192345,
          "target": "3--1--"
        },
        {
          "yaw": 2.9925516889873602,
          "pitch": 0.024873797829101818,
          "rotation": 5.497787143782138,
          "target": "6--2--"
        },
        {
          "yaw": -0.9777748168335627,
          "pitch": 0.26813547436262297,
          "rotation": 2.356194490192345,
          "target": "23---"
        },
        {
          "yaw": -1.5432283233973276,
          "pitch": 0.35261376292078594,
          "rotation": 3.141592653589793,
          "target": "20---"
        },
        {
          "yaw": -2.099682083459088,
          "pitch": 0.21620976497587563,
          "rotation": 0,
          "target": "16-"
        },
        {
          "yaw": -0.5851606252915911,
          "pitch": -0.25010178702717667,
          "rotation": 0,
          "target": "38--7"
        },
        {
          "yaw": -0.3501300809755712,
          "pitch": -0.3305284505365407,
          "rotation": 1.5707963267948966,
          "target": "40--8--"
        },
        {
          "yaw": -0.399286960006334,
          "pitch": 0.06010370206365323,
          "rotation": 0,
          "target": "18----"
        },
        {
          "yaw": -0.45202926081226025,
          "pitch": -0.12774115257188612,
          "rotation": 3.141592653589793,
          "target": "21-----7--8-"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.848279760522507,
          "pitch": -0.05073614473873178,
          "title": "Санузел",
          "text": "С ванной и биде"
        }
      ]
    },
    {
      "id": "20---",
      "name": "Вестибюль. У окна",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -2.398306972111863,
        "pitch": -0.0063279735310750596,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": -1.4727727855095036,
          "pitch": 0.39668811827629114,
          "rotation": 0.7853981633974483,
          "target": "16-"
        },
        {
          "yaw": 2.9958676949212855,
          "pitch": 0.3907350780065286,
          "rotation": 0,
          "target": "19------"
        },
        {
          "yaw": -3.082516696131261,
          "pitch": 0.24776617114675048,
          "rotation": 0.7853981633974483,
          "target": "4--2--"
        },
        {
          "yaw": 2.0644516942368076,
          "pitch": 0.5889902051978986,
          "rotation": 0,
          "target": "23---"
        },
        {
          "yaw": 1.9493053526888557,
          "pitch": 0.4324395448965763,
          "rotation": 4.71238898038469,
          "target": "22---"
        },
        {
          "yaw": 2.243191990771175,
          "pitch": 0.08361044473858925,
          "rotation": 18.84955592153877,
          "target": "18----"
        },
        {
          "yaw": 1.8869792997877255,
          "pitch": -0.16923516326166776,
          "rotation": 5.497787143782138,
          "target": "21-----7--8-"
        },
        {
          "yaw": 3.0876129840658315,
          "pitch": 0.03279476962032746,
          "rotation": 1.5707963267948966,
          "target": "1--1--"
        },
        {
          "yaw": -1.5318034417227704,
          "pitch": -0.28490133681586194,
          "rotation": 1.5707963267948966,
          "target": "16-"
        },
        {
          "yaw": 2.604138643014866,
          "pitch": -0.9388006904124602,
          "rotation": 0,
          "target": "17---"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 2.6055023380936255,
          "pitch": -0.03097827551424004,
          "title": "Санузел",
          "text": "Ванная, биде"
        }
      ]
    },
    {
      "id": "21-----7--8-",
      "name": "Вестибюль. На лестнице. Между 7 и 8 спальнями",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -0.6095936070510284,
        "pitch": -0.003178796877813639,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": -0.5993993326686766,
          "pitch": -0.5871528531847936,
          "rotation": 0,
          "target": "17---"
        },
        {
          "yaw": 2.091032406175552,
          "pitch": 0.1570330561661848,
          "rotation": 0,
          "target": "38--7"
        },
        {
          "yaw": -2.5084659555460007,
          "pitch": 0.4980910317864371,
          "rotation": 4.71238898038469,
          "target": "40--8--"
        },
        {
          "yaw": -2.9308208096818227,
          "pitch": 0.016265533406514265,
          "rotation": 4.71238898038469,
          "target": "39--8--"
        },
        {
          "yaw": -0.8911973438474412,
          "pitch": 0.8416526825871617,
          "rotation": 0,
          "target": "18----"
        },
        {
          "yaw": -0.675496575016723,
          "pitch": 0.5685233520350508,
          "rotation": 0,
          "target": "19------"
        },
        {
          "yaw": -0.6537521479082109,
          "pitch": 0.347983249331854,
          "rotation": 0,
          "target": "0--1--"
        },
        {
          "yaw": -0.19561557710393096,
          "pitch": -0.22379701569246002,
          "rotation": 0,
          "target": "17---"
        },
        {
          "yaw": -0.6078970057097166,
          "pitch": 0.17745353928522078,
          "rotation": 3.141592653589793,
          "target": "3--1--"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.236900776522404,
          "pitch": 0.2984801035707534,
          "title": "Санузел",
          "text": "С ванной"
        }
      ]
    },
    {
      "id": "22---",
      "name": "Теннисная комната. Цоколь",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 2.4050614540331505,
        "pitch": 0.06091566782875191,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": 0.968150560565018,
          "pitch": 0.410932961819654,
          "rotation": 0,
          "target": "23---"
        },
        {
          "yaw": -0.16980060054864055,
          "pitch": 0.3185793781531885,
          "rotation": 0,
          "target": "26--"
        },
        {
          "yaw": -0.162535914693283,
          "pitch": -0.1295378497643025,
          "rotation": 0,
          "target": "26--"
        },
        {
          "yaw": 0.9671371219849281,
          "pitch": -0.1692772160406424,
          "rotation": 0,
          "target": "23---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "23---",
      "name": "Цоколь. На лестнице",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 0.900125290738055,
        "pitch": 0.03553943886316624,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": 1.800158398608617,
          "pitch": -0.39679879774573656,
          "rotation": 0,
          "target": "20---"
        },
        {
          "yaw": -2.8287317816361703,
          "pitch": 0.2706525636805299,
          "rotation": 0,
          "target": "22---"
        },
        {
          "yaw": 0.41859972247996247,
          "pitch": 0.7586535637432981,
          "rotation": 0,
          "target": "24---"
        },
        {
          "yaw": 0.34464661700469534,
          "pitch": 0.4813121744181288,
          "rotation": 0,
          "target": "25---"
        },
        {
          "yaw": 1.1861726082893753,
          "pitch": 0.5151929298243552,
          "rotation": 0,
          "target": "44--12"
        },
        {
          "yaw": -2.6287967503467815,
          "pitch": -1.4578497448967518,
          "rotation": 0,
          "target": "21-----7--8-"
        },
        {
          "yaw": 1.1708237203470802,
          "pitch": 0.16871782326887086,
          "rotation": 7.853981633974483,
          "target": "44--12"
        },
        {
          "yaw": 0.3514270664179975,
          "pitch": 0.11429572824184575,
          "rotation": 0,
          "target": "25---"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.019939408361366873,
          "pitch": 0.34557780633844004,
          "title": "Технические помещения",
          "text": "Котельная, прачечная"
        }
      ]
    },
    {
      "id": "24---",
      "name": "Цоколь. Под лестницей",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -0.32814930047384294,
        "pitch": -0.009364702424299765,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": 0.830572761238555,
          "pitch": 0.5533863918911095,
          "rotation": 0,
          "target": "44--12"
        },
        {
          "yaw": 2.553408749060016,
          "pitch": -0.19841992248646,
          "rotation": 6.283185307179586,
          "target": "22---"
        },
        {
          "yaw": 2.8545952994509083,
          "pitch": 0.18649166397118577,
          "rotation": 5.497787143782138,
          "target": "23---"
        },
        {
          "yaw": -1.0053906009209097,
          "pitch": 0.5584757554690682,
          "rotation": 0,
          "target": "25---"
        },
        {
          "yaw": -1.2750709942082583,
          "pitch": 0.3110117977759774,
          "rotation": 0,
          "target": "41---9"
        },
        {
          "yaw": 1.974894462152447,
          "pitch": -0.601813416707321,
          "rotation": 5.497787143782138,
          "target": "20---"
        },
        {
          "yaw": 0.8607502794459911,
          "pitch": -0.013360253474955286,
          "rotation": 0,
          "target": "44--12"
        },
        {
          "yaw": -1.2713298085973737,
          "pitch": -0.010705810045669395,
          "rotation": 0,
          "target": "41---9"
        },
        {
          "yaw": -0.9406822290404016,
          "pitch": -0.030073675326587335,
          "rotation": 0,
          "target": "25---"
        },
        {
          "yaw": 2.13410104797915,
          "pitch": -1.5217364063478325,
          "rotation": 0,
          "target": "18----"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -2.3351309217529224,
          "pitch": 0.1534102884899049,
          "title": "<span style=\"font-size: 13px; background-color: rgba(58, 68, 84, 0.8);\">Технические помещения</span>",
          "text": "Котельная. Прачечная"
        }
      ]
    },
    {
      "id": "25---",
      "name": "Цоколь. В коридоре",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 2.202299168807892,
        "pitch": 0.0106325265110776,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": 0.7925403096077392,
          "pitch": 0.5997418302621611,
          "rotation": 1.5707963267948966,
          "target": "41---9"
        },
        {
          "yaw": 2.979280120323196,
          "pitch": 0.5711309384898158,
          "rotation": 0,
          "target": "42--10"
        },
        {
          "yaw": -2.528482234340757,
          "pitch": 0.22581918748680252,
          "rotation": 0,
          "target": "43--11"
        },
        {
          "yaw": -0.7698812697303481,
          "pitch": 0.5871257551033153,
          "rotation": 0,
          "target": "24---"
        },
        {
          "yaw": -0.789645102495129,
          "pitch": 0.07989128281286284,
          "rotation": 5.497787143782138,
          "target": "23---"
        },
        {
          "yaw": -1.125484626720711,
          "pitch": -0.31007281908397744,
          "rotation": 5.497787143782138,
          "target": "20---"
        },
        {
          "yaw": -0.8929804536329815,
          "pitch": -0.18230872823203015,
          "rotation": 0,
          "target": "22---"
        },
        {
          "yaw": 2.9782189554180665,
          "pitch": 0.01600375933535858,
          "rotation": 0,
          "target": "42--10"
        },
        {
          "yaw": 0.8649739426233598,
          "pitch": 0.014195103937868936,
          "rotation": 1.5707963267948966,
          "target": "41---9"
        },
        {
          "yaw": -2.532086345540147,
          "pitch": -0.012225314457452896,
          "rotation": 0,
          "target": "43--11"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.46106074718331413,
          "pitch": 0.07709490131333929,
          "title": "Технические помещения",
          "text": "Прачечная, котельная"
        }
      ]
    },
    {
      "id": "26--",
      "name": "Санузел. Цоколь",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 2.7040712274661534,
        "pitch": 0.2633231763902426,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": -0.2122055657629236,
          "pitch": 0.33815652190756573,
          "rotation": 0,
          "target": "22---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "27--1-",
      "name": "Спальня 1. Центр",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -3.11941825386452,
        "pitch": 0.27597973747010407,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": -0.9725682406933558,
          "pitch": 0.1718462576735682,
          "rotation": 0,
          "target": "17---"
        },
        {
          "yaw": -1.2363397464500494,
          "pitch": 0.5350479731506148,
          "rotation": 3.141592653589793,
          "target": "29--1--"
        },
        {
          "yaw": -2.4870551554836453,
          "pitch": 0.2571141376175259,
          "rotation": 3.9269908169872414,
          "target": "28--1--"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "28--1--",
      "name": "Спальня 1. У дивана",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 2.9586676605131164,
        "pitch": -0.008529250275380207,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": 2.6967124440289965,
          "pitch": 0.24577014057365076,
          "rotation": 1.5707963267948966,
          "target": "27--1-"
        },
        {
          "yaw": 2.1296989289613357,
          "pitch": 0.2510757199850353,
          "rotation": 0.7853981633974483,
          "target": "29--1--"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "29--1--",
      "name": "Спальня 1. У входа",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 2.6178248108869315,
        "pitch": 0.012413972668337436,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": 2.5669774848890015,
          "pitch": 0.48611582479415816,
          "rotation": 7.0685834705770345,
          "target": "27--1-"
        },
        {
          "yaw": -2.468130859268152,
          "pitch": 0.1382878414490456,
          "rotation": 3.9269908169872414,
          "target": "28--1--"
        },
        {
          "yaw": -0.2144189981586102,
          "pitch": 0.5872083629797036,
          "rotation": 5.497787143782138,
          "target": "17---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "30--2--",
      "name": "Спальня 2. У окна",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 2.8571013344009284,
        "pitch": 0.011666588622434304,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": -2.9513236141065313,
          "pitch": 0.3496655836221034,
          "rotation": 0,
          "target": "31--2-"
        },
        {
          "yaw": -3.008207734297379,
          "pitch": 0.1418621691201345,
          "rotation": 0,
          "target": "17---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "31--2-",
      "name": "Спальня 2. Центр",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 2.285579794256174,
        "pitch": 0.015341316430586005,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": 2.2948336221391585,
          "pitch": 0.3505602756607118,
          "rotation": 3.141592653589793,
          "target": "30--2--"
        },
        {
          "yaw": -0.8072325212591522,
          "pitch": 0.21479463437630741,
          "rotation": 0,
          "target": "17---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "32--3",
      "name": "Спальня 3",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 2.910236618887108,
        "pitch": 0.023266405316965333,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": 2.2827953481482792,
          "pitch": -0.2611076299233819,
          "rotation": 4.71238898038469,
          "target": "33--3---"
        },
        {
          "yaw": -2.318512376766444,
          "pitch": 0.19030129819405062,
          "rotation": 0,
          "target": "17---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "33--3---",
      "name": "Спальня 3. Вид из окна",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 1.6703698263883942,
        "pitch": 0.41517348403177934,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": 2.6859979205540307,
          "pitch": 0.34841038474087505,
          "rotation": 3.141592653589793,
          "target": "14-----"
        },
        {
          "yaw": -0.6471683283423886,
          "pitch": 0.05696966919000879,
          "rotation": 4.71238898038469,
          "target": "32--3"
        },
        {
          "yaw": 2.4970393576343985,
          "pitch": 0.5664766775907459,
          "rotation": 3.141592653589793,
          "target": "13---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "34--4",
      "name": "Спальня 4",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 2.6731637106268895,
        "pitch": 0.004734353815287307,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": 1.8456122237962624,
          "pitch": 0.048368578724735656,
          "rotation": 0,
          "target": "17---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "35--5",
      "name": "Спальня 5",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -3.125752946219718,
        "pitch": 0.011113242473395957,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": -3.0345341037701434,
          "pitch": 0.24793826534172858,
          "rotation": 0,
          "target": "36--5--6-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "36--5--6-",
      "name": "Между 5 и 6 спальнями",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -0.30083927551380363,
        "pitch": 0.8131830709157786,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": -3.0035264600934326,
          "pitch": 0.5143800808538543,
          "rotation": 0,
          "target": "17---"
        },
        {
          "yaw": 2.649129035045183,
          "pitch": 0.4373461985389717,
          "rotation": 4.71238898038469,
          "target": "47--2---"
        },
        {
          "yaw": 2.854055707567829,
          "pitch": 0.35886626242391806,
          "rotation": 0,
          "target": "31--2-"
        },
        {
          "yaw": -1.8770511051521641,
          "pitch": 0.7271624545734152,
          "rotation": 0.7853981633974483,
          "target": "35--5"
        },
        {
          "yaw": 1.285168487096282,
          "pitch": 0.7847783355937974,
          "rotation": 0,
          "target": "37--6"
        },
        {
          "yaw": 2.849184267836465,
          "pitch": 0.6917094633001355,
          "rotation": 0,
          "target": "17---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "37--6",
      "name": "Спальня 6",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 2.8927354693803906,
        "pitch": -0.001510966402829439,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": 2.1816993211756923,
          "pitch": 0.334572815569949,
          "rotation": 0,
          "target": "36--5--6-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "38--7",
      "name": "Спальня 7",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -2.9884880911218286,
        "pitch": 0.08496677521897311,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": 1.380844033332032,
          "pitch": 0.2910925949940193,
          "rotation": 0,
          "target": "21-----7--8-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "39--8--",
      "name": "Спальня 8. У окна",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 2.8782021529609416,
        "pitch": 0.016789255730060404,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": -3.0515848903965157,
          "pitch": 0.29824611170658244,
          "rotation": 4.71238898038469,
          "target": "40--8--"
        },
        {
          "yaw": -2.8088620798241593,
          "pitch": 0.14461078757546453,
          "rotation": 1.5707963267948966,
          "target": "21-----7--8-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "40--8--",
      "name": "Спальня 8. У входа",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -3.111229051277748,
        "pitch": 0.003987624717074922,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": 1.7571810609049763,
          "pitch": 0.5800714808435874,
          "rotation": 11.780972450961727,
          "target": "21-----7--8-"
        },
        {
          "yaw": 2.9002896434979757,
          "pitch": 0.12177295143291644,
          "rotation": 3.141592653589793,
          "target": "39--8--"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "41---9",
      "name": "Спальня  9",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 2.999759817989455,
        "pitch": 0.05234388255665223,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": -0.6871993717209577,
          "pitch": 0.4395127913745327,
          "rotation": 4.71238898038469,
          "target": "25---"
        },
        {
          "yaw": -0.6897965335202443,
          "pitch": -0.04858091544571863,
          "rotation": 4.71238898038469,
          "target": "25---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "42--10",
      "name": "Спальня 10",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -3.003961253171557,
        "pitch": 0.023305718628639838,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": -1.8133279440553025,
          "pitch": 0.4749872368562684,
          "rotation": 0,
          "target": "25---"
        },
        {
          "yaw": -1.8208756492886025,
          "pitch": -0.08509797409146458,
          "rotation": 0,
          "target": "25---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "43--11",
      "name": "Спальня 11'",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 2.7241175099145334,
        "pitch": 0.014416122682723298,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": 2.853935274780474,
          "pitch": 0.21618095807445492,
          "rotation": 0,
          "target": "25---"
        },
        {
          "yaw": 2.8532985336016257,
          "pitch": -0.04653661231547623,
          "rotation": 0,
          "target": "25---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "44--12",
      "name": "Спальня 12",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 2.986451645819102,
        "pitch": 0.05192034900430187,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": -1.8713378797401674,
          "pitch": 0.8799835667946656,
          "rotation": 0.7853981633974483,
          "target": "24---"
        },
        {
          "yaw": -1.8724839994270788,
          "pitch": -0.0029238192484832837,
          "rotation": 0,
          "target": "24---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "45--2--",
      "name": "Санузел. 2 этаж. Биде",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -2.9642066191736998,
        "pitch": 0.3542803572749147,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": -2.406557411120769,
          "pitch": 0.5309011020218506,
          "rotation": 10.210176124166829,
          "target": "47--2---"
        },
        {
          "yaw": -3.0890995119420097,
          "pitch": 0.6829987581701342,
          "rotation": 0,
          "target": "46--2--"
        },
        {
          "yaw": -2.246595198688155,
          "pitch": 0.13023333541843662,
          "rotation": 1.5707963267948966,
          "target": "17---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "46--2--",
      "name": "Санузел. 2 этаж. Центр",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 3.0888743579267253,
        "pitch": -0.019335161165498604,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": -0.559488174240304,
          "pitch": 0.6062027697410137,
          "rotation": 3.9269908169872414,
          "target": "45--2--"
        },
        {
          "yaw": -2.003394808775461,
          "pitch": 0.492265554419161,
          "rotation": 0,
          "target": "17---"
        },
        {
          "yaw": -2.0867384867207015,
          "pitch": 0.8694221920849277,
          "rotation": 2.356194490192345,
          "target": "47--2---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "47--2---",
      "name": "Санузел. 2 этаж. У выхода",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 3.0356380359967137,
        "pitch": 0.1638488570849912,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": 1.719889098018542,
          "pitch": 0.5828256235670697,
          "rotation": 2.356194490192345,
          "target": "45--2--"
        },
        {
          "yaw": -0.4214988808848563,
          "pitch": 0.9241155415736699,
          "rotation": 0,
          "target": "17---"
        },
        {
          "yaw": -0.42072158709520835,
          "pitch": -0.1406945960020458,
          "rotation": 0,
          "target": "17---"
        },
        {
          "yaw": 2.8236560233637764,
          "pitch": 0.8110204878691576,
          "rotation": 3.141592653589793,
          "target": "46--2--"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "48------",
      "name": "Перед калиткой по дороге к озеру",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 0,
        "pitch": 0,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": 0.03570014592794735,
          "pitch": 0.07782561925878895,
          "rotation": 0,
          "target": "49------"
        },
        {
          "yaw": -3.1382750575941376,
          "pitch": 0.06994772689744622,
          "rotation": 0,
          "target": "7---"
        },
        {
          "yaw": -3.120662504476007,
          "pitch": -0.055707633686038704,
          "rotation": 0,
          "target": "15--"
        },
        {
          "yaw": 2.7371971609045094,
          "pitch": 0.01380922919554095,
          "rotation": 0,
          "target": "9---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "49------",
      "name": "За калиткой по дороге к озеру",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -0.5817589441009954,
        "pitch": 0.04344105990440994,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": -0.34726518449355837,
          "pitch": 0.07282673597551081,
          "rotation": 0.7853981633974483,
          "target": "50---"
        },
        {
          "yaw": -3.1131075353170186,
          "pitch": 0.13480650095242552,
          "rotation": 0,
          "target": "48------"
        },
        {
          "yaw": -3.123529131212635,
          "pitch": 0.0002164211187221099,
          "rotation": 0,
          "target": "7---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "50---",
      "name": "На берегу озера",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -3.063931346928415,
        "pitch": -0.054004090133446425,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": -0.6034756559164194,
          "pitch": 0.1067983323887347,
          "rotation": 0,
          "target": "49------"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "51---",
      "name": "Парковка. У Ливерпуля",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": 2.0657331725044425,
        "pitch": 0.0061824822803266954,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": 2.6562216343167817,
          "pitch": 0.07509724079093516,
          "rotation": 3.141592653589793,
          "target": "52---"
        },
        {
          "yaw": 2.001848540230803,
          "pitch": 0.016817022852439578,
          "rotation": 3.141592653589793,
          "target": "14-----"
        },
        {
          "yaw": 0.4009165340679619,
          "pitch": -0.1326740723879798,
          "rotation": 0,
          "target": "22---"
        },
        {
          "yaw": 1.3516718480636278,
          "pitch": -0.9946389543952634,
          "rotation": 0,
          "target": "38--7"
        },
        {
          "yaw": -1.2584736438671609,
          "pitch": -0.784226236657771,
          "rotation": 0,
          "target": "39--8--"
        },
        {
          "yaw": 1.691939319393887,
          "pitch": 0.017353767794936914,
          "rotation": 4.71238898038469,
          "target": "13---"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -3.0498829385113755,
          "pitch": -0.13442694139544642,
          "title": "Коттедж Сингапур",
          "text": ""
        },
        {
          "yaw": -1.505645298543147,
          "pitch": -0.1501183720577206,
          "title": "Коттедж Валенсия",
          "text": "Коттедж Кипр<br>Коттедж Мальта"
        }
      ]
    },
    {
      "id": "52---",
      "name": "Парковка. У Сингапура",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1520,
      "initialViewParameters": {
        "yaw": -1.8813413603183022,
        "pitch": -0.026547780353768147,
        "fov": 1.4970014613970015
      },
      "linkHotspots": [
        {
          "yaw": -2.248125422752782,
          "pitch": 0.07310789631592485,
          "rotation": 0,
          "target": "51---"
        },
        {
          "yaw": -0.5376215025957976,
          "pitch": -0.06322366054122952,
          "rotation": 4.71238898038469,
          "target": "14-----"
        },
        {
          "yaw": -1.3425087252288286,
          "pitch": -0.0007250907047762212,
          "rotation": 4.71238898038469,
          "target": "13---"
        },
        {
          "yaw": -2.15761521003712,
          "pitch": -0.14712017032064395,
          "rotation": 0,
          "target": "38--7"
        },
        {
          "yaw": -2.3179254634719015,
          "pitch": -0.12578302418449283,
          "rotation": 0,
          "target": "39--8--"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.9816642642738262,
          "pitch": 0.013490965151296663,
          "title": "Хозяйственное помещение",
          "text": "Гараж с инструментами"
        },
        {
          "yaw": -2.5368983260714018,
          "pitch": -0.0004964200777592964,
          "title": "Коттедж Валенсия",
          "text": "коттедж Мальта<br>коттедж Кипр<br>"
        },
        {
          "yaw": 3.050156025629824,
          "pitch": -0.4941068133307276,
          "title": "Коттедж Сингапур",
          "text": "&nbsp;"
        },
        {
          "yaw": 1.8327003260936667,
          "pitch": 0.030105586219148606,
          "title": "Банкетный зал",
          "text": ""
        }
      ]
    }
  ],
  "name": "Ливерпуль. ВКинель.ру",
  "settings": {
    "mouseViewMode": "drag",
    "autorotateEnabled": false,
    "fullscreenButton": true,
    "viewControlButtons": false
  }
};
